Repository: maximzavzin22/solar_ios
Catalog: FusionSolar/*.lproj/Localizable.strings
Languages: ru_ru, uz_cyrl, uz_uz

# alarm_name_2080
source: Abnormal PV Module Configuration
ru_ru: Ненормальная конфигурация фотоэлектрического модуля
uz_cyrl: Фотоэлектрик модулиниг нормал бўлмаган конфигурацияси
uz_uz: Fotoelektrik modulinig normal bo'lmagan konfiguratsiyasi

# alarm_cause_2080
source: PV module configuration does not meet requirements, or the PV module output is reversely connected or short-circuited. Cause ID = 2, 3, 6, 7, 8, 9 Cause ID 2: The PV string power or the number of optimizers connected in series in a PV string exceeds the upper threshold. Cause ID 3: The number of optimizers connected in series in a PV string is less than the lower threshold, the PV string output is reversely connected, or the output of some optimizers in the PV string is reversely connected. Cause ID 6: Under the same MPPT, the number of optimizers connected in series in PV strings connected in parallel is different, or the output of some optimizers in PV strings is reversely connected. Cause ID 7: The optimizer installation position is changed, or PV strings are combined or exchanged. Cause ID 8: The sunlight is weak or changes abnormally. Cause ID 9: In partial configuration scenarios, the PV string voltage exceeds the SUN2000 input voltage specifications.
ru_ru: Конфигурация фотомодуля не соответствует требованиям, или выход фотоэлектрического модуля неправильно подключен или закорочен. Идентификатор причины = 2, 3, 6, 7, 8, 9 Идентификатор причины 2: Мощность фотоэлектрической цепочки или количество оптимизаторов, соединенных последовательно в фотоэлектрической цепочке, превышает верхний порог. Идентификатор причины 3: количество оптимизаторов, соединенных последовательно в PV-цепи, меньше нижнего порога, выход PV-цепи обратно подключен или выходы некоторых оптимизаторов в PV-цепи обратно подключены. Идентификатор причины 6: при одном и том же MPPT количество оптимизаторов, соединенных последовательно в фотоэлектрических цепочках, подключенных параллельно, различно, или выходы некоторых оптимизаторов в фотоэлектрических цепочках подключены обратно. Идентификатор причины 7: Изменено положение установки оптимизатора, либо объединены или заменены фотоэлектрические цепочки. Код причины 8: Солнечный свет слабый или меняется ненормально. Идентификатор причины 9: В сценариях частичной конфигурации напряжение фотоэлектрической цепочки превышает спецификации входного напряжения SUN2000.
uz_cyrl: Фотоэлектрик модулиниг конфигурацияси талабларга жавоб бермайди ёки фотоэлектрик модулининг чиқиши нотўғри уланган ёки қисқа туташган. Сабаб ID = 2, 3, 6, 7, 8, 9 Сабаб ID 2: Фотоэлектрик симининг кучи ёки Фотоэлектрик симида кетма-кет уланган оптималлаштирувчилар сони юқори чегарадан ошиб кетган. Сабаб ID 3: Фотоэлектрик симида кетма-кет уланган оптималлаштирувчилар сони пастки чегарадан камроқ, Фотоэлектрик симида чиқиши тескари ёки Фотоэлектрик симида баъзи оптималлаштирувчиларнинг чиқишлари тескари уланган. Сабаб ID 6: Худди шу MPPT учун параллел ёки турли уланган фотоэлектрик қаторларида кетма-кет уланган оптималлаштирувчилар сони, ёки фотоэлектрик қаторларидаги баъзи оптималлаштирувчиларнинг чиқишлари тескари уланган. Сабаб ID 7: Оптималлаштирувчи ўрнатиш позицияси ўзгартирилган ёки фотоэлктрик симлар бирлаштирилган ёки алмаштирилган. Сабаб ID 8: Қуёш нури заиф ёки нормал бўлмаган тарзда ўзгариб туради. Сабаб ID 9: Қисман конфигурация сценарийларида фотоэлектрик симининг кучланиши SUN2000 кириш кучланиши спетсификатсияларидан ошиб кетган.
uz_uz: Fotoelektrik modulinig konfiguratsiyasi talablarga javob bermaydi yoki fotoelektrik modulining chiqishi noto'g'ri ulangan yoki qisqa tutashgan. Sabab ID = 2, 3, 6, 7, 8, 9 Sabab ID 2: Fotoelektrik simining kuchi yoki Fotoelektrik simida ketma-ket ulangan optimallashtiruvchilar soni yuqori chegaradan oshib ketgan. Sabab ID 3: Fotoelektrik simida ketma-ket ulangan optimallashtiruvchilar soni pastki chegaradan kamroq, Fotoelektrik simida chiqishi teskari yoki Fotoelektrik simida ba'zi optimallashtiruvchilarning chiqishlari teskari ulangan. Sabab ID 6: Xuddi shu MPPT uchun parallel yoki turli ulangan fotoelektrik qatorlarida ketma-ket ulangan optimallashtiruvchilar soni, yoki fotoelektrik qatorlaridagi ba'zi optimallashtiruvchilarning chiqishlari teskari ulangan. Sabab ID 7: Optimallashtiruvchi o'rnatish pozitsiyasi o'zgartirilgan yoki fotoelktrik simlar birlashtirilgan yoki almashtirilgan. Sabab ID 8: Quyosh nuri zaif yoki normal bo'lmagan tarzda o'zgarib turadi. Sabab ID 9: Qisman konfiguratsiya stsenariylarida fotoelektrik simining kuchlanishi SUN2000 kirish kuchlanishi spetsifikatsiyalaridan oshib ketgan.

# alarm_suggestion_2080
source: Check whether the total number of PV modules, number of PV modules in a string, and number of PV strings meet requirements and whether the PV module output is reversely connected. Cause ID 2: Check whether the PV string power or the number of PV modules connected in series in the PV string exceeds the upper threshold. Cause ID 3: Check whether the number of optimizers connected in series in the PV string is below the lower threshold. Check whether the PV string output is reversely connected. Check whether the PV string output is disconnected. Check whether the optimizer output extension cable is correct (positive connector at one end and negative connector at the other). Cause ID 6: Check whether the number of optimizers connected in series in the PV strings connected in parallel under the same MPPT is the same. Check whether the optimizer output extension cable is correct (positive connector at one end and negative connector at the other). Cause ID 7: When the sunlight is normal, perform the optimizer search function again. Cause ID 8: When the sunlight is normal, perform the optimizer search function again. Cause ID 9: Calculate the PV string voltage based on the number of PV modules in the PV string and check whether the PV string voltage exceeds the upper threshold of the SUN2000 input voltage.
ru_ru: Проверьте, соответствует ли общее количество фотоэлектрических модулей, количество фотоэлектрических модулей в цепочке и количество фотоэлектрических цепочек требованиям, а также обратно ли подключен выход фотоэлектрического модуля. Идентификатор причины 2: проверьте, превышает ли мощность фотоэлектрической цепочки или количество фотоэлектрических модулей, последовательно соединенных в фотоэлектрическую цепочку, верхний порог. Идентификатор причины 3: Проверьте, не превышает ли количество оптимизаторов, соединенных последовательно в цепочке PV, нижнего порога. Проверьте, подключен ли выход фотоэлектрической цепочки обратно. Проверьте, отключен ли выход фотоэлектрической цепочки. Проверьте исправность удлинительного кабеля выхода оптимизатора (положительный разъем на одном конце и отрицательный разъем на другом). Идентификатор причины 6: Проверьте, одинаково ли количество оптимизаторов, подключенных последовательно в фотоэлектрических цепочках, подключенных параллельно под одним и тем же MPPT. Проверьте исправность удлинительного кабеля выхода оптимизатора (положительный разъем на одном конце и отрицательный разъем на другом). Идентификатор причины 7: Когда солнечный свет станет нормальным, снова выполните функцию поиска оптимизатора. Идентификатор причины 8: Когда солнечный свет станет нормальным, снова выполните функцию поиска оптимизатора. Идентификатор причины 9: Рассчитайте напряжение фотоэлектрической цепочки на основе количества фотоэлектрических модулей в фотоэлектрической цепочке и проверьте, превышает ли напряжение фотоэлектрической цепочки верхний порог входного напряжения SUN2000.
uz_cyrl: Фотоэлектрик модулларининг умумий сони, қатордаги фотоэлектрик модулларининг сони ва фотоэлектрик қаторларининг сони талабларга жавоб беришини, шунингдек фотоэлектрик модулининг чиқиши тўғри уланганлигини текширинг. Сабаб ID 2: Фотоэлектрик симининг қуввати ёки фотоэлектрик қаторида кетма-кет уланган фотоэлектрик модуллари сони юқори чегарадан ошмаганлигини текширинг. Сабаб ID 3: Фотоэлектрик занжирида кетма-кет уланган оптималлаштирувчилар сони пастки чегарадан ошиб кетмаганлигини текширинг. Фотоэлектрик симининг чиқиши қайта уланганлигини текширинг. Фотоэлектрик симининг чиқиши ўчирилганлигини текширинг. Оптималлаштирувчи чиқиш узатма кабели тўғри эканлигини текширинг (бир учида ижобий улагич, иккинчисида салбий улагич). Сабаб ID 6: Худди шу MPPT остида параллел равишда уланган фотоэлектрик симларида кетма-кет уланган оптималлаштирувчилар сони бир хил эканлигини текширинг. Оптималлаштирувчи чиқиш узатма кабелининг созламаларини текширинг (бир учида ижобий улагич ва бошқа учида салбий улагич). Сабаб ID 7: Қуёш нури нормал ҳолатга келганда, оптималлаштирувчи қидирув функциясини бажаринг. Сабаб ID 8: Қуёш нури нормал ҳолатга келганда, оптималлаштирувчи қидирув функциясини яна бажаринг. Сабаб ID 9: Фотоэлектрик симидаги фотоэлектрик модуллари сони асосида фотоэлектрик симининг кучланишини ҳисобланг ва фотоэлектрик симининг кучланиши SUN2000 кириш кучланишининг юқори чегарасидан ошиб кетмаганлигини текширинг.
uz_uz: Fotoelektrik modullarining umumiy soni, qatordagi fotoelektrik modullarining soni va fotoelektrik qatorlarining soni talablarga javob berishini, shuningdek fotoelektrik modulining chiqishi to'g'ri ulanganligini tekshiring. Sabab ID 2: Fotoelektrik simining quvvati yoki fotoelektrik qatorida ketma-ket ulanganfotoelektrik modullari soni yuqori chegaradan oshmaganligini tekshiring. Sabab ID 3: Fotoelektrik zanjirida ketma-ket ulangan optimallashtiruvchilar soni pastki chegaradan oshib ketmaganligini tekshiring. Fotoelektrik simining chiqishi qayta ulanganligini tekshiring. Fotoelektrik simining chiqishi o'chirilganligini tekshiring. Optimallashtiruvchi chiqish uzatma kabeli to'g'ri ekanligini tekshiring (bir uchida ijobiy ulagich, ikkinchisida salbiy ulagich). Sabab ID 6: Xuddi shu MPPT ostida parallel ravishda ulangan fotoelektrik simlarida ketma-ket ulangan optimallashtiruvchilar soni bir xil ekanligini tekshiring. Optimallashtiruvchi chiqish uzatma kabelining sozlamalarini tekshiring (bir uchida ijobiy ulagich va boshqa uchida salbiy ulagich). Sabab ID 7: Quyosh nuri normal holatga kelganda, optimallashtiruvchi qidiruv funksiyasini bajaring. Sabab identifikatori 8: Quyosh nuri normal holatga kelganda, optimallashtiruvchi qidiruv funksiyasini yana bajaring. Sabab ID 9: Fotoelektrik simidagi fotoelektrik modullari soni asosida fotoelektrik simining kuchlanishini hisoblang va fotoelektrik simining kuchlanishi SUN2000 kirish kuchlanishining yuqori chegarasidan oshib ketmaganligini tekshiring.

# alarm_name_2082
source: Grid-tied/Off-grid Controller Abnormal
ru_ru: Неисправность контроллера, подключенного к сети/автономного от сети
uz_cyrl: Тармоқ уланган/тармоқда эмас бошқарувчи хатоси
uz_uz: Tarmoq ulangan/tarmoqda emas boshqaruvchi xatosi

# alarm_cause_2082
source: Cause ID 1: The SUN2000 fails to communicate with the Backup Box. Cause ID 2: An unrecoverable fault occurs on a circuit inside the Backup Box.
ru_ru: Идентификатор причины 1: SUN2000 не удается связаться с Backup Box. Идентификатор причины 2: В цепи внутри резервного блока возникла неисправимая неисправность.
uz_cyrl: Сабаб ID 1: SUN2000 Backup Box билан боғлана олмади. Сабаб ID 2: Захира блоки ичидаги симда тузатиб бўлмайдиган хатолик юз берди.
uz_uz: Sabab ID 1: SUN2000 Backup Box bilan bog'lana olmadi. Sabab ID 2: Zaxira bloki ichidagi simda tuzatib bo'lmaydigan xatolik yuz berdi.

# alarm_suggestion_2082
source: 1. Send a shutdown command on the app. Turn off the AC output switch, DC input switch, and battery switch. 2. Check whether the power cable and RS485 cable between the Backup Box and the SUN2000 are normal. 3. After 5 minutes, turn on the battery switch, AC output switch, and DC input switch. 4. If the alarm persists, contact your dealer or Huawei technical support.
ru_ru: 1. Отправьте команду выключения в приложении. Выключите выходной переключатель переменного тока, входной переключатель постоянного тока и переключатель батареи. 2. Проверьте исправность кабеля питания и кабеля RS485 между Backup Box и SUN2000. 3. Через 5 минут включите переключатель аккумулятора, выходной переключатель переменного тока и входной переключатель постоянного тока. 4. Если сигнал тревоги не исчезнет, обратитесь к своему дилеру или в службу технической поддержки Huawei.
uz_cyrl: 1. Иловага ўчириш буйруғини юборинг. Ўзгарувчан токнинг чиқиш ўчиргичини, ўзгармас токнинг кириш ўчиргичини ва батарея ўчиргичини ўчиринг. 2. Backup Box ва SUN2000 ўртасидаги қувват кабели ва RS485 кабелини текширинг. 3. 5 дақиқадан сўнг, батарея ўчиргичини, ўзгарувчан токнинг чиқиш ўчиргичини, ўзгармас токнинг кириш ўчиргичин ёқинг. 4. Агар безовталик сигнали йўқолмаса, дилерингизга ёки Huawei техник қўллаб-қувватлаш бўлимига мурожаат қилинг.
uz_uz: 1. Ilovaga o'chirish buyrug'ini yuboring. O'zgaruvchan tokning chiqish o'chirgichini, o'zgarmas tokning kirish o'chirgichini va batareya o'chirgichini o'chiring. 2. Backup Box va SUN2000 o'rtasidagi quvvat kabeli va RS485 kabelini tekshiring. 3. 5 daqiqadan so'ng, batareya o'chirgichini, o'zgaruvchan tokning chiqish o'chirgichini, o'zgarmas tokning kirish o'chirgichin yoqing. 4. Agar bezovtalik signali yo'qolmasa, dileringizga yoki Huawei texnik qo'llab-quvvatlash bo'limiga murojaat qiling.

# alarm_name_2087
source: Internal Fan Abnormal
ru_ru: Внутренний вентилятор не работает
uz_cyrl: Ички вентилятор ишламаяпти
uz_uz: Ichki ventilyator ishlamayapti

# alarm_cause_2087
source: The internal fan is short-circuited, the power supply is insufficient, or the fan is damaged.
ru_ru: Внутренний вентилятор закорочен, недостаточно питания или вентилятор поврежден.
uz_cyrl: Ички вентилятор қисқа туташга учраган, қувват манбаи етарли эмас ёки вентилятор шикастланган.
uz_uz: Ichki ventilyator qisqa tutashga uchragan, quvvat manbai yetarli emas yoki ventilyator shikastlangan.

# alarm_suggestion_2087
source: Turn off the AC output switch and then the DC input switch. Turn them on after 5 minutes and wait for the SUN2000 to connect to the power grid. If the alarm persists, contact your dealer or Huawei technical support.
ru_ru: Выключите выходной переключатель переменного тока, а затем входной переключатель постоянного тока. Включите их через 5 минут и подождите, пока SUN2000 подключится к электросети. Если сигнал тревоги не исчезнет, обратитесь к своему дилеру или в службу технической поддержки Huawei.
uz_cyrl: Ўзгарувчан токнинг чиқиш ўчиргичини, сўнг ўзгармас токнинг кириш ўчиргичини ўчиринг. 5 дақиқадан сўнг уларни ёқинг ва SUN2000 электр тармоғига уланишини кутинг. Агар безовталик сигнали йўқолмаса, дилерингизга ёки Huawei техник қўллаб-қувватлаш бўлимига мурожаат қилинг.
uz_uz: O'zgaruvchan tokning chiqish o'chirgichini, so'ng o'zgarmas tokning kirish o'chirgichini o'chiring. 5 daqiqadan so'ng ularni yoqing va SUN2000 elektr tarmog'iga ulanishini kuting. Agar bezovtalik signali yo'qolmasa, dileringizga yoki Huawei texnik qo'llab-quvvatlash bo'limiga murojaat qiling.

# alarm_name_2088
source: Abnormal DC Protection Unit
ru_ru: Аномальный блок защиты постоянного тока
uz_cyrl: Аномал ўзгармас токдан ҳимоя қилиш блоки
uz_uz: Anomal o'zgarmas tokdan himoya qilish bloki

# alarm_cause_2088
source: Cause ID 1: The fuse is not in position or is blown. Cause ID 2: The two relays on the breaking board are open-circuited. Cause ID 3: The contact points of the DC switches are stuck.
ru_ru: Идентификатор причины 1: Предохранитель не на месте или перегорел. Идентификатор причины 2: Оба реле на размыкающей плате разомкнуты. Идентификатор причины 3: Залипли контакты выключателей постоянного тока.
uz_cyrl: Сабаб ID 1: Сақлагич жойида эмас ёки ёниб кетган. Сабаб ID 2: Очилиш платадаги иккала реле ҳам очиқ. Сабаб ID 3: Ўзгармас ток ўчиргичларининг контактлари қотиб қолган.
uz_uz: Sabab ID 1: Saqlagich joyida emas yoki yonib ketgan. Sabab ID 2: Ochilish platadagi ikkala rele ham ochiq. Sabab ID 3: O'zgarmas tok o'chirgichlarining kontaktlari qotib qolgan.

# alarm_suggestion_2088
source: 1. Turn off the AC output switch and then the DC input switch. Turn them on after 5 minutes and wait for the SUN2000 to connect to the power grid. If the alarm persists, contact your dealer or Huawei technical support to replace the faulty component. 2 If the LED1 indicator (PV indicator) is off, contact your dealer or Huawei technical support to replace the SUN2000. If the LED1 indicator (PV indicator) is on, wait until the PV string current decreases to below 0.5 A. Turn off the AC output switch and then the DC input switch. Turn them on after 5 minutes and wait for the SUN2000 to connect to the power grid. If the alarm persists, contact your dealer or Huawei technical support.
ru_ru: 1. Выключите выходной переключатель переменного тока, а затем входной переключатель постоянного тока. Включите их через 5 минут и подождите, пока SUN2000 подключится к электросети. Если сигнал тревоги не исчезнет, обратитесь к своему дилеру или в службу технической поддержки Huawei. заменить неисправный компонент. 2 Если индикатор LED1 (индикатор PV) не горит, обратитесь к своему дилеру или в службу технической поддержки Huawei для замены SUN2000. Если индикатор LED1 (индикатор PV) горит, подождите, пока ток фотоэлектрической цепочки не уменьшится ниже 0,5 А. Выключите выходной переключатель переменного тока, а затем входной переключатель постоянного тока. Включите их через 5 минут и подождите, пока SUN2000 подключится к электросети. Если сигнал тревоги не исчезнет, обратитесь к своему дилеру или в службу технической поддержки Huawei.
uz_cyrl: Ўзгарувчан токнинг чиқиш ўчиргичини, сўнг ўзгармас токнинг кириш ўчиргичини ўчиринг. 5 дақиқадан сўнг уларни ёқинг ва SUN2000 электр тармоғига уланишини кутинг. Агар безовталик сигнали ёъқолмаса, дилерингизга ёки Huawei техник қўллаб-қувватлаш бўлимига мурожаат қилинг. Агар LED1 (PV индикатори) ёнмаса, SUN2000 ни алмаштириш учун дилерингизга ёки Huawei техник қўллаб-қувватлаш бўлимига мурожаат қилинг. Агар LED1 (PV индикатори) ёқилса, фотоэлектрик симининг оқими 0,5А дан паст бўлгунча кутинг. Ўзгарувчан токнинг чиқиш ўчиргичини, сўнг ўзгармас токнинг кириш ўчиргичини ўчиринг. 5 дақиқадан сўнг уларни ёқинг ва SUN2000 электр тармоғига уланишини кутинг. Агар безовталик сигнали йўқолмаса, дилерингизга ёки Huawei техник қўллаб-қувватлаш бўлимига мурожаат қилинг.
uz_uz: 1. O'zgaruvchan tokning chiqish o'chirgichini, so'ng o'zgarmas tokning kirish o'chirgichini o'chiring. 5 daqiqadan so'ng ularni yoqing va SUN2000 elektr tarmog'iga ulanishini kuting. Agar bezovtalik signali yo'qolmasa, dileringizga yoki Huawei texnik qo'llab-quvvatlash bo'limiga murojaat qiling. 2. Agar LED1 (PV indikatori) yonmasa, SUN2000 ni almashtirish uchun dileringizga yoki Huawei texnik qo'llab-quvvatlash bo'limiga murojaat qiling. Agar LED1 (PV indikatori) yoqilsa, fotoelektrik simining oqimi 0,5A dan past bo'lguncha kuting. O'zgaruvchan tokning chiqish o'chirgichini, so'ng o'zgarmas tokning kirish o'chirgichini o'chiring. 5 daqiqadan so'ng ularni yoqing va SUN2000 elektr tarmog'iga ulanishini kuting. Agar bezovtalik signali yo'qolmasa, dileringizga yoki Huawei texnik qo'llab-quvvatlash bo'limiga murojaat qiling.

# alarm_name_2090
source: Abnormal Active Power Scheduling Instruction
ru_ru: Ненормальная инструкция по планированию активной мощности
uz_cyrl: Нормал бўлмаган фаол қувватни режалаштириш бўйича кўрсатмалар
uz_uz: Normal bo'lmagan faol quvvatni rejalashtirish bo'yicha ko'rsatmalar

# alarm_cause_2090
source: 1. The DI input is abnormal. 2. The DI input is inconsistent with the configuration.
ru_ru: 1. Вход цифрового входа ненормальный. 2. Вход DI не соответствует конфигурации.
uz_cyrl: 1. DI кириш нормал ҳолатда эмас. 2. DI кириш конфигурацияга мос келмади.
uz_uz: 1. DI kirish normal holatda emas. 2. DI kirish konfiguratsiyaga mos kelmadi.

# alarm_suggestion_2090
source: 1. Check whether the cables are connected correctly to the DI ports. 2. Access the configuration page for the dry contact DI active power scheduling mode and view the DI signal configuration mapping table. Contact the power grid company to check whether the configurations in the mapping table are complete and meet the requirements.
ru_ru: 1. Проверьте, правильно ли подключены кабели к портам DI. 2. Откройте страницу конфигурации режима планирования активной мощности цифрового входа с сухими контактами и просмотрите таблицу сопоставления конфигурации сигналов цифрового входа. Обратитесь в электросетевую компанию, чтобы проверить, полны ли конфигурации в таблице сопоставления и соответствуют ли они требованиям.
uz_cyrl: Кабеллар DI портларига тўғри уланганлигини текширинг. Қуруқ контактли рақамли кириш фаол қувват режалаштириш режимини созлаш саҳифасини очинг ва рақамли кириш сигнали конфигурацияси жадвалини кўриб чиқинг. Жадвалдаги конфигурациялар тўлиқ ва талабларга жавоб беришини текшириш учун электр тармоғи корхонаси билан боғланинг.
uz_uz: 1. Kabellar DI portlariga to'g'ri ulanganligini tekshiring. 2. Quruq kontaktli raqamli kirish faol quvvat rejalashtirish rejimini sozlash sahifasini oching va raqamli kirish signali konfiguratsiyasi jadvalini ko'rib chiqing. Jadvaldagi konfiguratsiyalar toʻliq va talablarga javob berishini tekshirish uchun elektr tarmog'i korxonasi bilan bog'laning.

# alarm_name_2091
source: Abnormal Reactive Power Scheduling Instruction
ru_ru: Инструкция по планированию аномальной реактивной мощности
uz_cyrl: Нормал бўлмаган реактив қувватни режалаштириш бўйича кўрсатмалар
uz_uz: Normal bo'lmagan reaktiv quvvatni rejalashtirish bo'yicha ko'rsatmalar

# alarm_cause_2091
source: 1. The DI input is abnormal. 2. The DI input is inconsistent with the configuration.
ru_ru: 1. Вход цифрового входа ненормальный. 2. Вход DI не соответствует конфигурации.
uz_cyrl: 1. DI кириш нормал ҳолатда эмас. 2. DI кириш конфигурацияга мос келмади.
uz_uz: 1. DI kirish normal holatda emas. 2. DI kirish konfiguratsiyaga mos kelmadi.

# alarm_suggestion_2091
source: 1. Check whether the cables are connected correctly to the DI ports. 2. Access the configuration page for the dry contact DI reactive power scheduling mode and view the DI signal configuration mapping table. Contact the power grid company to check whether the configurations in the mapping table are complete and meet the requirements.
ru_ru: 1. Проверьте, правильно ли подключены кабели к портам DI. 2. Откройте страницу конфигурации режима планирования реактивной мощности цифрового входа с сухими контактами и просмотрите таблицу сопоставления конфигурации сигналов цифрового входа. Обратитесь в электросетевую компанию, чтобы проверить, полны ли конфигурации в таблице сопоставления и соответствуют ли они требованиям.
uz_cyrl: 1. Кабеллар DI портларига тўғри уланганлигини текширинг. 2. Қуруқ контактли рақамли кириш реактив қувват режалаштириш режимини созлаш саҳифасини очинг ва рақамли кириш сигнали конфигурацияси жадвалини кўриб чиқинг. Жадвалдаги конфигурациялар тўлиқ ва талабларга жавоб беришини текшириш учун электр тармоғи корхонаси билан боғланинг.
uz_uz: 1. Kabellar DI portlariga to'g'ri ulanganligini tekshiring. 2. Quruq kontaktli raqamli kirish reaktiv quvvat rejalashtirish rejimini sozlash sahifasini oching va raqamli kirish signali konfiguratsiyasi jadvalini ko'rib chiqing. Jadvaldagi konfiguratsiyalar toʻliq va talablarga javob berishini tekshirish uchun elektr tarmog'i korxonasi bilan bog'laning.

# alarm_name_2092
source: Abnormal CT Cable Connection
ru_ru: Неправильное подключение кабеля трансформатора тока
uz_cyrl: Ток трансформатори кабелининг нотўғри уланиши
uz_uz: Tok transformatori kabelining noto'g'ri ulanishi
