Repository: maximzavzin22/solar_ios
Catalog: FusionSolar/*.lproj/Localizable.strings
Languages: ru_ru, uz_cyrl, uz_uz

# alarm_suggestion_2064
source: Turn off the AC output switch and DC input switch, and then turn them on after 5 minutes. If the alarm persists, contact your dealer or Huawei technical support.
ru_ru: Выключите выходной переключатель переменного тока и входной переключатель постоянного тока, а затем включите их через 5 минут. Если сигнал тревоги не исчезнет, обратитесь к своему дилеру или в службу технической поддержки Huawei.
uz_cyrl: Ўзгарувчан токнинг чиқиш ўчиргичини ва ўзгармас токнинг кириш ўчиргичини ўчиринг ва 5 дақиқадан сўнг уларни қайта ёқинг. Агар сигнал ёъқолиб қолмаса, дилерингизга ёки Huawei техник қўллаб-қувватлаш бўлимига мурожаат қилинг.
uz_uz: O'zgaruvchan tokning chiqish o'chirgichini va o'zgarmas tokning kirish o'chirgichini o'chiring va 5 daqiqadan so'ng ularni qayta yoqing. Agar signal yo'qolib qolmasa, dileringizga yoki Huawei texnik qo'llab-quvvatlash bo'limiga murojaat qiling.

# alarm_name_2065
source: Upgrade Failed or Version Mismatch
ru_ru: Ошибка обновления или несоответствие версии
uz_cyrl: Янгилаш хатоси ёки версия номувофиқлиги
uz_uz: Yangilash xatosi yoki versiya nomuvofiqligi

# alarm_cause_2065
source: The upgrade does not complete normally. Cause ID = 1–4, 7 Cause ID 1: The software and hardware of the main controller do not match. Cause ID 2: The main and auxiliary controller software versions do not match. Cause ID 3: The monitoring and power controller software versions do not match. Cause ID 4: The upgrade fails. Cause ID 7: The optimizer upgrade fails.
ru_ru: Обновление не завершается нормально. Идентификатор причины = 1–4, 7. Идентификатор причины 1: Программное и аппаратное обеспечение главного контроллера не совпадают. Идентификатор причины 2: Версии программного обеспечения основного и вспомогательного контроллера не совпадают. Идентификатор причины 3: Версии программного обеспечения мониторинга и контроллера питания не совпадают. Идентификатор причины 4: обновление не выполнено. Идентификатор причины 7: Сбой обновления оптимизатора.
uz_cyrl: Янгилаш нормал якунланмади. Сабаб ID = 1–4, 7. Сабаб ID 1: Асосий бошқарувчининг дастурий ва аппарат таъминоти мос келмаяпти. Сабаб ID 2: Асосий ва иккиламчи контроллерларнинг дастурий таъминот версиялари мос келмаяпти. Сабаб ID 3: Мониторинг ва қувват бошқарувчиси дастурий таъминот версиялари мос келмаяпти. Сабаб ID 4: Янгилаш амалга ошмади. Сабаб ID 7: Оптимизатор янгиланишида хато.
uz_uz: Yangilash normal yakunlanmadi. Sabab ID = 1–4, 7. Sabab ID 1: Asosiy boshqaruvchining dasturiy va apparat ta'minoti mos kelmayapti. Sabab ID 2: Asosiy va ikkilamchi kontrollerlarning dasturiy ta'minot versiyalari mos kelmayapti. Sabab ID 3: Monitoring va quvvat boshqaruvchisi dasturiy ta'minot versiyalari mos kelmayapti. Sabab ID 4: Yangilash amalga oshmadi. Sabab ID 7: Optimizator yangilanishida xato.

# alarm_suggestion_2065
source: 1. Perform an upgrade again. 2. If the upgrade fails for multiple times, contact your dealer or Huawei technical support.
ru_ru: 1. Выполните обновление еще раз. 2. Если обновление не удалось выполнить несколько раз, обратитесь к своему дилеру или в службу технической поддержки Huawei.
uz_cyrl: 1. Янгилашни қайта бажаринг. 2. Агар янгиланишни бир неча марта амалга ошириб бўлмаса, дилерингизга ёки Huawei техник қўллаб-қувватлаш бўлимига мурожаат қилинг.
uz_uz: 1. Yangilashni qayta bajaring. 2. Agar yangilanishni bir necha marta amalga oshirib bo'lmasa, dileringizga yoki Huawei texnik qo'llab-quvvatlash bo'limiga murojaat qiling.

# alarm_name_2066
source: License Expired
ru_ru: Срок действия лицензии истек
uz_cyrl: Лицензия муддати тугаган
uz_uz: Litsenziya muddati tugagan

# alarm_cause_2066
source: 1. The privilege certificate has entered the grace period. 2. The privilege feature will be invalid soon.
ru_ru: 1. Сертификат привилегий вступил в льготный период. 2. Функция привилегий скоро станет недействительной.
uz_cyrl: 1. Имтиёз сертификати учун имтиёзли давр киритилди. 2. Имтиёз хусусияти тез орада ўз кучини йўқотади.
uz_uz: 1. Imtiyoz sertifikati uchun imtiyozli davr kiritildi. 2. Imtiyoz xususiyati tez orada o‘z kuchini yo‘qotadi.

# alarm_suggestion_2066
source: 1. Apply for a new certificate. 2. Load the new certificate
ru_ru: 1. Подайте заявку на новый сертификат. 2. Загрузите новый сертификат
uz_cyrl: 1. Янги сертификат олиш учун ариза беринг. 2. Янги сертификатни юкланг.
uz_uz: 1. Yangi sertifikat olish uchun ariza bering. 2. Yangi sertifikatni yuklang.

# alarm_name_61440
source: Monitoring Unit Faulty
ru_ru: Мониторинговый блок неисправен
uz_cyrl: Кузатув блоки нотўғри
uz_uz: Kuzatuv bloki noto'g'ri

# alarm_cause_61440
source: 1. The flash memory is insufficient. 2. The flash memory has bad sectors.
ru_ru: 1. Недостаточно флэш-памяти. 2. Во флэш-памяти имеются поврежденные сектора.
uz_cyrl: 1. Флеш хотира етарли эмас. 2. Флеш хотирада урилган секторлар мавжуд.
uz_uz: 1. Flesh xotira yetarli emas. 2. Flesh xotirada urilgan sektorlar mavjud.

# alarm_suggestion_61440
source: Turn off the AC output switch and DC input switch, and then turn them on after 5 minutes. If the alarm persists, replace the monitoring board or contact your dealer Huawei technical support.
ru_ru: Выключите выходной переключатель переменного тока и входной переключатель постоянного тока, а затем включите их через 5 минут. Если сигнал тревоги не исчезнет, замените плату мониторинга или обратитесь в службу технической поддержки Huawei к своему дилеру.
uz_cyrl: Ўзгарувчан токнинг чиқиш ўчиргичи ва ўзгармас токнинг кириш ўчиргичини ўчиринг ва 5 дақиқадан сўнг уларни қайта ёқинг. Агар сигнал ёъқолмаса, мониторинг платасини алмаштиринг ёки Huawei техник қўллаб-қувватлаш бўлимида дилерингизга мурожаат қилинг.
uz_uz: O'zgaruvchan tokning chiqish o'chirgichi va o'zgarmas tokning kirish o'chirgichini o'chiring va 5 daqiqadan so'ng ularni qayta yoqing. Agar signal yo'qolmasa, monitoring platasini almashtiring yoki Huawei texnik qo'llab-quvvatlash bo'limida dileringizga murojaat qiling.

# alarm_name_2067
source: Faulty Power Collector
ru_ru: Неисправен коллектор питания
uz_cyrl: Нотўғри қувват коллектори
uz_uz: Noto'g'ri quvvat kollektori

# alarm_cause_2067
source: The smart power sensor is disconnected.
ru_ru: Интеллектуальный датчик мощности отключен.
uz_cyrl: Смарт қувват сенсори ўчирилган
uz_uz: Smart quvvat sensori oʻchirilgan

# alarm_suggestion_2067
source: 1. Check that the configured power meter model is the same as the actual model. 2. Check that the communications parameters for the smart power sensors are the same as the SUN2000 RS485 configurations. 3. Check whether the smart power sensor is powered on and whether the RS485 communications cable is connected.
ru_ru: 1. Убедитесь, что настроенная модель измерителя мощности совпадает с фактической моделью. 2. Убедитесь, что параметры связи для интеллектуальных датчиков мощности такие же, как и в конфигурациях SUN2000 RS485. 3. Проверьте, включен ли интеллектуальный датчик мощности и подключен ли кабель связи RS485.
uz_cyrl: 1. Созланган қувват ўлчагич модели ҳақиқий модел билан бир хил эканлигига ишонч ҳосил қилинг. 2. Ақлли қувват сенсорлари учун алоқа параметрлари SUN2000 RS485 конфигурациялари билан бир хил эканлигига ишонч ҳосил қилинг. 3. Смарт қувват сенсори ёқилганлигини ва RS485 алоқа кабели уланганлигини текширинг.
uz_uz: 1. Sozlangan quvvat o'lchagich modeli haqiqiy model bilan bir xil ekanligiga ishonch hosil qiling. 2. Aqlli quvvat sensorlari uchun aloqa parametrlari SUN2000 RS485 konfiguratsiyalari bilan bir xil ekanligiga ishonch hosil qiling. 3. Smart quvvat sensori yoqilganligini va RS485 aloqa kabeli ulanganligini tekshiring.

# alarm_name_2068
source: Battery Abnormal
ru_ru: Неисправность батареи
uz_cyrl: Батарея нормал ҳолатда эмас
uz_uz: Batareya normal holatda emas

# alarm_cause_2068
source: The battery is faulty, disconnected, or the battery circuit breaker is OFF when the battery is running. Cause ID = 1–4 Cause ID 1: The battery communication is abnormal. Cause ID 2: The battery port experiences overcurrent. Cause ID 3: The battery enabling cable is not properly connected. Cause ID 4: The battery port voltage is abnormal.
ru_ru: Аккумулятор неисправен, отсоединен или автоматический выключатель аккумулятора выключен, когда аккумулятор работает. Идентификатор причины = 1–4. Идентификатор причины 1: Связь с аккумулятором ненормальная. Идентификатор причины 2: В порту аккумулятора наблюдается перегрузка по току. Код причины 3: Кабель включения аккумулятора подключен неправильно. Идентификатор причины 4: Ненормальное напряжение порта аккумулятора.
uz_cyrl: Иш пайтида батареянинг носозлиги, узилганлиги ёки нотўғри ишлаши. Сабаб ID = 1–4. Сабаб ID 1: Батарея билан алоқа нормал ҳолатда эмас. Сабаб ID 2: Батарея портида ҳаддан ташқари оқим ҳолати мавжуд. Сабаб ID 3: батарея қувват кабели тўғри уланмаган. Сабаб ID 4: Батарея портидаги кучланиш нормал эмас.
uz_uz: Ish paytida batareyaning nosozligi, uzilganligi yoki noto'g'ri ishlashi. Sabab ID = 1–4. Sabab ID 1: Batareya bilan aloqa normal holatda emas. Sabab ID 2: Batareya portida haddan tashqari oqim holati mavjud. Sabab ID 3: batareya quvvat kabeli to'g'ri ulanmagan. Sabab ID 4: Batareya portidagi kuchlanish normal emas.

# alarm_suggestion_2068
source: 1. If the battery fault indicator is steady on or blinking, contact the battery supplier. 2. Check that the battery enabling/power/communications cable is correctly installed, and that the communications parameters are the same as the SUN2000 RS485 configurations. 3. Check that the auxiliary power switch on the battery is set to ON. 4. Send a shutdown command on the app. Turn off the AC output switch, DC input switch, and battery switch. Then turn on the battery switch, AC output switch, and DC input switch in sequence after 5 minutes. 5. If the alarm persists, contact your dealer or Huawei technical support.
ru_ru: 1. Если индикатор неисправности батареи горит постоянно или мигает, обратитесь к поставщику батареи. 2. Убедитесь, что кабель включения аккумулятора/питания/связи правильно установлен и что параметры связи такие же, как в конфигурациях SUN2000 RS485. 3. Убедитесь, что переключатель вспомогательного питания на аккумуляторе установлен в положение ВКЛ. 4. Отправьте в приложение команду выключения. Выключите выходной переключатель переменного тока, входной переключатель постоянного тока и переключатель аккумулятора. Затем через 5 минут последовательно включите переключатель аккумулятора, выходной переключатель переменного тока и входной переключатель постоянного тока. 5. Если сигнал тревоги не исчезнет, обратитесь к своему дилеру или в службу технической поддержки Huawei.
uz_cyrl: Батарея носозлик индикатори барқарор равишда ёниб турса ёки милтиллаётган бўлса, батарея етказиб берувчига мурожаат қилинг. Батарея/қувват/алоқа кабели тўғри ўрнатилганлигига ва алоқа параметрлари SUN2000 RS485 конфигурациялари билан бир хиллигига ишонч ҳосил қилинг. Батареядаги ёрдамчи қувват тугмаси ЁҚИҚ ҳолатига ўрнатилганлигига ишонч ҳосил қилинг. Иловага ўчириш буйруғини юборинг. Ўзгарувчан токнинг чиқиш ўчиргичини, ўзгармас токнинг кириш ўчиргичини ва батарея ўчиргичини ўчиринг. Кейин 5 дақиқадан сўнг, батарея калитини, ўзгарувчан токнинг чиқиш ўчиргичини ва Ўзгармас токнинг кириш ўчиргичини кетма-кет ёқинг. Агар сигнал йўқолмаса, дилерингизга ёки Huawei техник қўллаб-қувватлаш бўлимига мурожаат қилинг.
uz_uz: 1. Batareya nosozlik indikatori barqaror ravishda yonib tursa yoki miltillayotgan bo'lsa, batareya yetkazib beruvchiga murojaat qiling. 2. Batareya/quvvat/aloqa kabeli to'g'ri o'rnatilganligiga va aloqa parametrlari SUN2000 RS485 konfiguratsiyalari bilan bir xilligiga ishonch hosil qiling. 3. Batareyadagi yordamchi quvvat tugmasi YOQIQ holatiga o'rnatilganligiga ishonch hosil qiling. 4. Ilovaga o'chirish buyrug'ini yuboring. O'zgaruvchan tokning chiqish o'chirgichini, o'zgarmas tokning kirish o'chirgichini va batareya o'chirgichini o'chiring. Keyin 5 daqiqadan so'ng, batareya kalitini, o'zgaruvchan tokning chiqish o'chirgichini va O'zgarmas tokning kirish o'chirgichini ketma-ket yoqing. 5. Agar signal yo'qolmasa, dileringizga yoki Huawei texnik qo'llab-quvvatlash bo'limiga murojaat qiling.

# alarm_name_2069
source: Battery Reverse Connection
ru_ru: Обратное подключение батареи
uz_cyrl: Тескари батарея уланиши
uz_uz: Teskari batareya ulanishi

# alarm_cause_2069
source: Reverse positive and negative poles when the battery is connected to the SUN2000.
ru_ru: Поменяйте местами положительный и отрицательный полюсы, когда батарея подключена к SUN2000.
uz_cyrl: Батарея SUN2000 га уланганда ижобий ва салбий қутбларни алмаштиринг.
uz_uz: Batareya SUN2000 ga ulanganda ijobiy va salbiy qutblarni almashtiring.

# alarm_suggestion_2069
source: 1. Turn off the AC output switch, DC input switch, and battery switch, and turn on the battery auxiliary power switch. Wait for 5 minutes. 2. Check the cable connection by referring to the SUN2000L Battery and Smart Meter Quick Installation Guide. 3. After ensuring that the battery power cable is correctly connected, turn on the battery auxiliary power switch, battery switch, AC output switch, and DC input switch in sequence. If the alarm persists, contact the battery manufacturer.
ru_ru: 1. Выключите выходной переключатель переменного тока, входной переключатель постоянного тока и переключатель аккумулятора, а затем включите переключатель вспомогательного питания аккумулятора. Подождите 5 минут. 2. Проверьте подключение кабеля, обратившись к Краткому руководству по установке батареи и интеллектуального счетчика SUN2000L. 3. Убедившись, что кабель питания аккумулятора подключен правильно, последовательно включите выключатель вспомогательного питания аккумулятора, выключатель аккумулятора, выходной переключатель переменного тока и входной переключатель постоянного тока. Если сигнал тревоги не исчезнет, обратитесь к производителю аккумулятора.
uz_cyrl: 1. Ўзгарувчан токнинг чиқиш ўчиргичини, ўзгармас токнинг кириш ўчиргичини ва батарея тугмасини ўчиринг. Батареянинг ёрдамчи қувват тугмасини ёқинг ва 5 дақиқа кутинг. 2. SUN2000 батарея ва Смарт ҳисоблагични ўрнатиш қўлланмасидаги кўрсатмаларга риоя қилиб, кабел уланишларини текширинг. 3. Батарея қувват кабели тўғри уланганлигига ишонч ҳосил қилинг. Батареянинг ёрдамчи қувват тугмачасини, батарея тугмачасини, ўзгарувчан токнинг чиқиш ўчиргичини ва ўзгармас токнинг кириш ўчиргичини кетма-кет ёқинг. Агар сигнал йўқолмаса, қўшимча ёрдам ва диагностика учун батарея ишлаб чиқарувчисига мурожаат қилиш тавсия этилади.
uz_uz: 1. O'zgaruvchan tokning chiqish o’chirgichini, o'zgarmas tokning kirish o'chirgichini va batareya tugmasini o'chiring. Batareyaning yordamchi quvvat tugmasini yoqing va 5 daqiqa kuting. 2. SUN2000L batareya va Smart hisoblagichni oʻrnatish qoʻllanmasidagi koʻrsatmalarga rioya qilib, kabel ulanishlarini tekshiring. 3. Batareya quvvat kabeli to'g'ri ulanganligiga ishonch hosil qiling. Batareyaning yordamchi quvvat tugmachasini, batareya tugmachasini, o'zgaruvchan tokning chiqish o'chirgichini va o'zgarmas tokning kirish o'chirgichini ketma-ket yoqing. Agar signal yo'qolmasa, qo'shimcha yordam va diagnostika uchun batareya ishlab chiqaruvchisiga murojaat qilish tavsiya etiladi.

# alarm_name_2070
source: Active Islanding
ru_ru: Активное изолирование
uz_cyrl: Фаол оролланиш
uz_uz: Faol orollanish

# alarm_cause_2070
source: When the power grid experiences an AC power outage, the SUN2000 detects islanding proactively.
ru_ru: Когда в электросети происходит отключение переменного тока, SUN2000 заранее обнаруживает секционирование.
uz_cyrl: Ўзгарувчан токнинг қувват узилиши содир бўлганда, SUN2000 оролни олдиндан аниқлайди.
uz_uz: O'zgaruvchan tokning quvvat uzilishi sodir bo'lganda, SUN2000 orolni oldindan aniqlaydi.

# alarm_suggestion_2070
source: Check that the grid connection voltage of the SUN2000 is normal.
ru_ru: Убедитесь, что напряжение подключения к сети SUN2000 в норме.
uz_cyrl: SUN2000 қувват манбаи кучланиши нормал эканлигига ишонч ҳосил қилинг.
uz_uz: SUN2000 quvvat manbai kuchlanishi normal ekanligiga ishonch hosil qiling.

# alarm_name_2071
source: Passive Islanding
ru_ru: Пассивное изолирование
uz_cyrl: Пассив оролланиш
uz_uz: Passiv orollanish

# alarm_cause_2071
source: When the power grid experiences an AC power outage, the SUN2000 detects an island grid passively.
ru_ru: Когда в электросети происходит отключение переменного тока, SUN2000 пассивно обнаруживает изолированную сеть.
uz_cyrl: Электр тармоғида ўзгарувчан токнинг узилиши содир бўлганда, SUN2000 пассив тарзда изоляция қилинган тармоқни аниқлайди.
uz_uz: Elektr tarmog'ida o'zgaruvchan tokning uzilishi sodir bo'lganda, SUN2000 passiv tarzda izolyatsiya qilingan tarmoqni aniqlaydi.

# alarm_suggestion_2071
source: Check whether the voltage at the grid connection point of the SUN2000 is normal.
ru_ru: Проверьте, в норме ли напряжение в точке подключения к сети SUN2000.
uz_cyrl: SUN2000 тармоғига уланиш нуқтасидаги кучланиш нормал эканлигини текширинг.
uz_uz: SUN2000 tarmog'iga ulanish nuqtasidagi kuchlanish normal ekanligini tekshiring.

# alarm_name_2072
source: Transient AC Overvoltage
ru_ru: Переходное перенапряжение переменного тока
uz_cyrl: Ўзгарувчан токнинг ортиқча кучланиши
uz_uz: O'zgaruvchan tokning ortiqcha kuchlanishi

# alarm_cause_2072
source: The SUN2000 detects that the phase voltage exceeds the transient AC overvoltage protection threshold.
ru_ru: SUN2000 обнаруживает, что фазное напряжение превышает порог защиты от переходного перенапряжения переменного тока.
uz_cyrl: SUN2000 фазали кучланиш ўзгарувчан токнинг ортиқча кучланишдан ҳимояланиш чегарасидан ошиб кетганини аниқлайди.
uz_uz: SUN2000 fazali kuchlanish o'zgaruvchan tokning ortiqcha kuchlanishdan himoyalanish chegarasidan oshib ketganini aniqlaydi.

# alarm_suggestion_2072
source: 1. If the voltage at the grid connection point is too high, contact the local power operator. 2. If you have confirmed that the grid connection voltage exceeds the upper threshold and have obtained the consent of the local power operator, modify the overvoltage protection threshold. 3. Check whether the peak grid voltage exceeds the upper threshold.
ru_ru: 1. Если напряжение в точке подключения к сети слишком высокое, обратитесь к местному энергооператору. 2. Если вы подтвердили, что напряжение подключения к сети превышает верхний порог, и получили согласие местного энергоснабжающего предприятия, измените порог защиты от перенапряжения. 3. Проверьте, превышает ли пиковое напряжение сети верхний порог.
uz_cyrl: 1. Агар тармоққа уланиш нуқтасида кучланиш жуда юқори бўлса, маҳаллий энергия операторига мурожаат қилинг. 2. Агар сиз тармоққа уланиш кучланишининг юқори чегарадан ҳам юқори эканлигини тасдиқлаган бўлсангиз ва маҳаллий энергия таъминоти ташкилотидан рухсат олган бўлсангиз, кучланишдан ҳимояланиш чегарасини ўзгартиринг. 3. Тармоқнинг энг юқори кучланиши юқори чегарадан ошиб кетганлигини текширинг.
uz_uz: 1. Agar tarmoqqa ulanish nuqtasida kuchlanish juda yuqori bo'lsa, mahalliy energiya operatoriga murojaat qiling. 2. Agar siz tarmoqqa ulanish kuchlanishining yuqori chegaradan ham yuqori ekanligini tasdiqlagan bo'lsangiz va mahalliy energiya ta'minoti tashkilotidan ruxsat olgan bo'lsangiz, kuchlanishdan himoyalanish chegarasini o'zgartiring. 3. Tarmoqning eng yuqori kuchlanishi yuqori chegaradan oshib ketganligini tekshiring.

# alarm_name_2075
source: External Device Port Short Circuit
ru_ru: Короткое замыкание порта внешнего устройства
uz_cyrl: Ташқи қурилма портининг қисқа туташуви
uz_uz: Tashqi qurilma portining qisqa tutashuvi

# alarm_cause_2075
source: The SUN2000 Alarm port is short-circuited when supplying 12 V power to a peripherals device.
ru_ru: Порт сигнализации SUN2000 закорочен при подаче питания 12 В на периферийное устройство.
uz_cyrl: SUN2000 сигнал порти периферик қурилмага 12V қувват берилганда қисқа туташган.
uz_uz: SUN2000 signal porti periferik qurilmaga 12V quvvat berilganda qisqa tutashgan.

# alarm_suggestion_2075
source: 1. Turn off the AC and DC switches on the SUN2000 and disconnect the peripherals device from the Alarm port. Then power on the SUN2000 again and try to clear the alarm manually over the mobile phone app by following the instructions in the user manual. If the alarm persists, contact your dealer or Huawei technical support. If the alarm is cleared, the Alarm port is normal. Check whether the power port pin of the peripherals device is short-circuited. 2. After replacing the peripherals device, start the self-check according to the user manual and ensure that the port functions properly.
ru_ru: 1. Выключите переключатели переменного и постоянного тока на SUN2000 и отсоедините периферийное устройство от порта сигнализации. Затем снова включите SUN2000 и попытайтесь сбросить сигнал тревоги вручную через приложение для мобильного телефона, следуя инструкциям в разделе руководство пользователя. Если сигнал тревоги не исчезнет, обратитесь к дилеру или в службу технической поддержки Huawei. Если сигнал тревоги исчез, значит, порт сигнала тревоги исправен. Проверьте, не закорочен ли контакт порта питания периферийного устройства. 2. После замены периферийного устройства запустите самопроверку согласно руководству пользователя и убедитесь, что порт работает правильно.
uz_cyrl: 1. SUN2000 даги ўзгарувчан ва ўзгармас токларнинг ўчиргичларини ўчиринг ва периферик қурилмани сигнал портидан ажратинг. Сўнг SUN2000-ни яна ёқинг ва фойдаланувчи қўлланмасидаги кўрсатмаларга амал қилган ҳолда мобил телефон иловаси орқали сигнални қўлда тиклашга ҳаракат қилинг. Агар безовталик сигнали йўқолмаса, дилерингизга ёки Huawei техник қўллаб-қувватлаш бўлимига мурожаат қилинг. Агар безовталик сигнали ўчирилган бўлса, сигнал порти нормал ишлаяпган бўлса, периферик қурилманинг қувват портининг контакти қисқа туташувга учрамаганлигини текширинг. 2. Периферик қурилмани алмаштиргандан сўнг, фойдаланувчи қўлланмасига мувофиқ ўз-ўзини синаб кўриш функциясини ишга тушуринг ва портнинг тўғри ишлашига ишонч ҳосил қилинг.
uz_uz: 1. SUN2000 dagi o'zgaruvchan va o'zgarmas toklarning o'chirgichlarini o'chiring va periferik qurilmani signal portidan ajrating. So'ng SUN2000-ni yana yoqing va foydalanuvchi qo'llanmasidagi ko'rsatmalarga amal qilgan holda mobil telefon ilovasi orqali signalni qo'lda tiklashga harakat qiling. Agar bezovtalik signali yo'qolmasa, dileringizga yoki Huawei texnik qo'llab-quvvatlash bo'limiga murojaat qiling. Agar bezovtalik signali o'chirilgan bo'lsa, signal porti normal ishlayapgan bo'lsa, periferik qurilmaning quvvat portining kontakti qisqa tutashuvga uchramaganligini tekshiring. 2. Periferik qurilmani almashtirgandan so'ng, foydalanuvchi qo'llanmasiga muvofiq o'z-o'zini sinab ko'rish funktsiyasini ishga tushuring va portning to'g'ri ishlashiga ishonch hosil qiling.

# alarm_name_2077
source: Off-grid Output
ru_ru: Выход вне сети
uz_cyrl: Автоном чиқишнинг ортиқча юкланиши
uz_uz: Avtonom chiqishning ortiqcha yuklanishi

# alarm_cause_2077
source: The output is overloaded or short-circuited.
ru_ru: Выход перегружен или закорочен.
uz_cyrl: Чиқиш ҳаддан ташқари юкланган ёки қисқа тутилган.
uz_uz: Chiqish haddan tashqari yuklangan yoki qisqa tutilgan.

# alarm_suggestion_2077
source: 1. Check whether the device output is short-circuited. 2. Check whether the device load exceeds the rated value.
ru_ru: 1. Проверьте, не закорочен ли выход устройства. 2. Проверьте, превышает ли нагрузка устройства номинальное значение.
uz_cyrl: 1. Қурилма чиқиши қисқа туташмаганлигини текширинг. 2. Қурилма юкининг номинал қийматдан ошиб кетганлигини текширинг.
uz_uz: 1. Qurilma chiqishi qisqa tutashmaganligini tekshiring. 2. Qurilma yukining nominal qiymatdan oshib ketganligini tekshiring.
