Repository: maximzavzin22/solar_ios
Catalog: FusionSolar/*.lproj/Localizable.strings
Languages: ru_ru, uz_cyrl, uz_uz

# alarm_name_2036
source: Grid Overfrequency
ru_ru: Повышение частоты сети
uz_cyrl: Тармоқ частотасининг ортиши
uz_uz: Tarmoq chastotasining ortishi

# alarm_cause_2036
source: Power grid exception: The actual power grid frequency is higher than the standard requirement for the local power grid.
ru_ru: Исключение в электросети: фактическая частота электросети выше стандартного требования для местной электросети.
uz_cyrl: Электр тармоғидан истисно: Ҳақиқий тармоқ частотаси маҳаллий тармоқ учун стандарт талаблардан юқори.
uz_uz: Elektr tarmog'idan istisno: Haqiqiy tarmoq chastotasi mahalliy tarmoq uchun standart talablardan yuqori.

# alarm_suggestion_2036
source: 1. If the alarm occurs occasionally, the power grid may be abnormal temporarily. The SUN2000 automatically recovers after detecting that the power grid becomes normal. 2. If the alarm occurs frequently, check whether the power grid frequency is within the allowed range. If not, contact the local power operator. If yes, modify the grid overfrequency protection threshold through the mobile app, SmartLogger, or NMS with the consent of the local power operator.
ru_ru: 1. Если аварийный сигнал возникает время от времени, возможно, электросеть временно неисправна. SUN2000 автоматически восстанавливает работу после обнаружения, что электросеть приходит в норму. 2. Если сигнал тревоги возникает часто, проверьте, находится ли частота электросети в допустимом диапазоне. В противном случае обратитесь к местному оператору электроснабжения. Если да, измените порог защиты от повышения частоты сети через мобильное приложение, SmartLogger или NMS с согласия местного оператора электроэнергетики.
uz_cyrl: 1. Агар сигнал вақти-вақти билан пайдо бўлса, электр тармоғи вақтинча носоз бўлиши мумкин. SUN2000 электр тармоғининг нормал ҳолатини аниқлаганидан сўнг автоматик равишда тикланади. 2. Агар сигнал тез-тез рўй берса, сиз электр тармоғининг кучланиши мақбул диапазонда эканлигини текширишингиз керак. Акс ҳолда, маҳаллий электр таъминоти операторига мурожаат қилиш тавсия этилади. Агар тармоқдаги кучланиш мақбул диапазонда бўлса, паст кучланишдан ҳимоя қилиш чегараси маҳаллий энергия операторининг розилиги билан мобил илова, SmartLogger ёки Тармоқни бошқариш тизими (NMS) орқали ўзгартирилиши мумкин.
uz_uz: 1. Agar signal vaqti-vaqti bilan paydo bo'lsa, elektr tarmog'i vaqtincha nosoz bo'lishi mumkin. SUN2000 elektr tarmog'ining normal holatini aniqlaganidan so'ng avtomatik ravishda tiklanadi. 2. Agar signal tez-tez ro'y bersa, siz elektr tarmog'ining kuchlanishi maqbul diapazonda ekanligini tekshirishingiz kerak. Aks holda, mahalliy elektr ta'minoti operatoriga murojaat qilish tavsiya etiladi. Agar tarmoqdagi kuchlanish maqbul diapazonda bo'lsa, past kuchlanishdan himoya qilish chegarasi mahalliy energiya operatorining roziligi bilan mobil ilova, SmartLogger yoki Tarmoqni boshqarish tizimi (NMS) orqali o'zgartirilishi mumkin.

# alarm_name_2037
source: Grid Underfrequency
ru_ru: Пониженная частота сети
uz_cyrl: Камайтирилган тармоқ частотаси
uz_uz: Kamaytirilgan tarmoq chastotasi

# alarm_cause_2037
source: Power grid exception: The actual power grid frequency is lower than the standard requirement for the local power grid.
ru_ru: Исключение в электросети: фактическая частота электросети ниже стандартных требований для местной электросети.
uz_cyrl: Электр тармоғидан истисно: Ҳақиқий тармоқ частотаси маҳаллий тармоқ учун стандарт талаблардан юқори.
uz_uz: Elektr tarmog'idan istisno: Haqiqiy tarmoq chastotasi mahalliy tarmoq uchun standart talablardan yuqori.

# alarm_suggestion_2037
source: 1. If the alarm occurs occasionally, the power grid may be abnormal temporarily. The SUN2000 automatically recovers after detecting that the power grid becomes normal. 2. If the alarm occurs frequently, check whether the power grid frequency is within the allowed range. If not, contact the local power operator. If yes, modify the grid underfrequency protection threshold through the mobile app, SmartLogger, or NMS with the consent of the local power operator.
ru_ru: 1. Если сигнал тревоги возникает время от времени, возможно, электросеть временно неисправна. SUN2000 автоматически восстанавливает работу после обнаружения, что электросеть приходит в норму. 2. Если сигнал тревоги возникает часто, проверьте, находится ли частота электросети в допустимом диапазоне. В противном случае обратитесь к местному оператору электроснабжения. Если да, измените порог защиты от понижения частоты сети через мобильное приложение, SmartLogger или NMS с согласия местного оператора электроэнергетики.
uz_cyrl: 1. Агар сигнал вақти-вақти билан пайдо бўлса, электр тармоғи вақтинча носоз бўлиши мумкин. SUN2000 электр тармоғининг нормал ҳолатини аниқлаганидан сўнг автоматик равишда тикланади. 2. Агар сигнал тез-тез рўй берса, сиз электр тармоғининг кучланиши мақбул диапазонда эканлигини текширишингиз керак. Акс ҳолда, маҳаллий электр таъминоти операторига мурожаат қилиш тавсия этилади. Агар тармоқдаги кучланиш мақбул диапазонда бўлса, паст кучланишдан ҳимоя қилиш чегараси маҳаллий энергия операторининг розилиги билан мобил илова, SmartLogger ёки Тармоқни бошқариш тизими (NMS) орқали ўзгартирилиши мумкин.
uz_uz: 1. Agar signal vaqti-vaqti bilan paydo bo'lsa, elektr tarmog'i vaqtincha nosoz bo'lishi mumkin. SUN2000 elektr tarmog'ining normal holatini aniqlaganidan so'ng avtomatik ravishda tiklanadi. 2. Agar signal tez-tez ro'y bersa, siz elektr tarmog'ining kuchlanishi maqbul diapazonda ekanligini tekshirishingiz kerak. Aks holda, mahalliy elektr ta'minoti operatoriga murojaat qilish tavsiya etiladi. Agar tarmoqdagi kuchlanish maqbul diapazonda bo'lsa, past kuchlanishdan himoya qilish chegarasi mahalliy energiya operatorining roziligi bilan mobil ilova, SmartLogger yoki Tarmoqni boshqarish tizimi (NMS) orqali o'zgartirilishi mumkin.

# alarm_name_2038
source: Unstable Grid Frequency
ru_ru: Нестабильная частота сети
uz_cyrl: Барқарор тармоқ частотаси
uz_uz: Barqaror tarmoq chastotasi

# alarm_cause_2038
source: Power grid exception: The actual grid frequency change rate does not comply with the local power grid standard.
ru_ru: Исключение в электросети: фактическая скорость изменения частоты сети не соответствует местному стандарту электросети.
uz_cyrl: Электр тармоғидан истисно: Тармоқ частотасини ўзгартиришнинг ҳақиқий тезлиги маҳаллий электр тармоқлари стандартига мос келмайди.
uz_uz: Elektr tarmog'idan istisno: Tarmoq chastotasini o'zgartirishning haqiqiy tezligi mahalliy elektr tarmoqlari standartiga mos kelmaydi.

# alarm_suggestion_2038
source: 1. If the alarm occurs occasionally, the power grid may be abnormal temporarily. The SUN2000 automatically recovers after detecting that the power grid becomes normal. 2. If the alarm occurs frequently, check whether the power grid frequency is within the allowed range. If not, contact the local power operator.
ru_ru: 1. Если сигнал тревоги возникает время от времени, возможно, электросеть временно неисправна. SUN2000 автоматически восстанавливает работу после обнаружения того, что электросеть приходит в норму. 2. Если сигнал тревоги возникает часто, проверьте, находится ли частота электросети в допустимом диапазоне. В противном случае обратитесь к местному энергооператору.
uz_cyrl: 1. Агар сигнал вақти-вақти билан пайдо бўлса, электр тармоғи вақтинча носоз бўлиши мумкин. SUN2000 электр тармоғининг нормал ҳолатини аниқлаганидан сўнг автоматик равишда тикланади. 2. Агар сигнал тез-тез содир бўлса, электр тармоғи частотаси мақбул диапазонда эканлигини текшириш керак. Акс ҳолда, маҳаллий электр таъминоти операторига мурожаат қилиш тавсия этилади.
uz_uz: 1. Agar signal vaqti-vaqti bilan paydo bo'lsa, elektr tarmog'i vaqtincha nosoz bo'lishi mumkin. SUN2000 elektr tarmog'ining normal holatini aniqlaganidan so'ng avtomatik ravishda tiklanadi. 2. Agar signal tez-tez sodir bo'lsa, elektr tarmog'i chastotasi maqbul diapazonda ekanligini tekshirish kerak. Aks holda, mahalliy elektr ta'minoti operatoriga murojaat qilish tavsiya etiladi.

# alarm_name_2039
source: Output Overcurrent
ru_ru: Сверхток на выходе
uz_cyrl: Чиқишнинг ортиқча оқими
uz_uz: Chiqishning ortiqcha oqimi

# alarm_cause_2039
source: The power grid voltage drops dramatically or the power grid is short-circuited. As a result, the SUN2000 transient output current exceeds the upper threshold and therefore the SUN2000 protection is triggered.
ru_ru: Напряжение электросети резко падает или в сети произошло короткое замыкание. В результате переходный выходной ток SUN2000 превышает верхний порог, и поэтому срабатывает защита SUN2000.
uz_cyrl: Электр таъминоти кучланиши кескин пасаяди ёки электр таъминоти тармоғида қисқа туташув содир этган. Натижада, SUN2000 нинг вақтинчалик чиқиш оқими юқори чегарадан ошиб кетган, ва шунинг учун SUN2000 ҳимояси фаоллашган.
uz_uz: Elektr ta'minoti kuchlanishi keskin pasayadi yoki elektr ta'minoti tarmog'ida qisqa tutashuv sodir etgan. Natijada, SUN2000 ning vaqtinchalik chiqish oqimi yuqori chegaradan oshib ketgan, va shuning uchun SUN2000 himoyasi faollashgan.

# alarm_suggestion_2039
source: 1. The SUN2000 detects its external working conditions in real time. After the fault is rectified, the SUN2000 automatically recovers. 2. If the alarm occurs frequently and affects the energy yield of the power plant, check whether the output is short-circuited. If the alarm persists, contact your dealer or Huawei technical support.
ru_ru: 1. SUN2000 определяет внешние условия работы в режиме реального времени. После устранения неисправности SUN2000 автоматически восстанавливается. 2. Если сигнал тревоги возникает часто и влияет на выход энергии электростанции, проверьте, не закорочен ли выход. Если сигнал тревоги не исчезнет, обратитесь к своему дилеру или в службу технической поддержки Huawei.
uz_cyrl: 1. SUN2000 доимий равишда ташқи иш шароитларини реал вақтда кузатиб боради ва носозлик тузатилгандан сўнг автоматик равишда тикланади. 2. Агар сигнал тез-тез содир бўлса ва электр станциясининг қувват чиқишига таъсир қилса, чиқишнинг қисқа туташуви содир бўмаганини текшириш керак. Агар сигнал давом этса, дилерингизга ёки Huawei техник ёрдамига мурожаат қилиш тавсия этилади.
uz_uz: 1. SUN2000 doimiy ravishda tashqi ish sharoitlarini real vaqtda kuzatib boradi va nosozlik tuzatilgandan so'ng avtomatik ravishda tiklanadi. 2. Agar signal tez-tez sodir bo'lsa va elektr stantsiyasining quvvat chiqishiga ta'sir qilsa, chiqishning qisqa tutashuvi sodir bo'maganini tekshirish kerak. Agar signal davom etsa, dileringizga yoki Huawei texnik yordamiga murojaat qilish tavsiya etiladi.

# alarm_name_2040
source: Output DC Component Overhigh
ru_ru: Превышение выходного компонента постоянного тока
uz_cyrl: Чиқиш ўзгармас ток компонентининг ошиб кетиши
uz_uz: Chiqish o'zgarmas tok komponentining oshib ketishi

# alarm_cause_2040
source: The DC component of the SUN2000 output current exceeds the specified upper threshold.
ru_ru: Постоянная составляющая выходного тока SUN2000 превышает указанный верхний порог.
uz_cyrl: SUN2000 чиқиш оқимининг ўзгармас ток компоненти белгиланган юқори чегарадан ошиб кетган.
uz_uz: SUN2000 chiqish oqimining o'zgarmas tok komponenti belgilangan yuqori chegaradan oshib ketgan.

# alarm_suggestion_2040
source: 1. The SUN2000 detects its external working conditions in real time. After the fault is rectified, the SUN2000 automatically recovers. 2. If the alarm occurs frequently, contact your dealer or Huawei technical support.
ru_ru: 1. SUN2000 определяет внешние условия работы в режиме реального времени. После устранения неисправности SUN2000 автоматически восстанавливается. 2. Если сигнал тревоги возникает часто, обратитесь к своему дилеру или в службу технической поддержки Huawei.
uz_cyrl: 1. SUN2000 доимий равишда ташқи иш шароитларини реал вақтда кузатиб боради ва носозлик тузатилгандан сўнг автоматик равишда тикланади. 2. Агар сигнал тез-тез содир бўлса ва электр станциясининг қувват чиқишига таъсир қилса, чиқишнинг қисқа туташуви содир бўмаганини текшириш керак. Агар сигнал давом этса, дилерингизга ёки Huawei техник ёрдамига мурожаат қилиш тавсия этилади.
uz_uz: 1. SUN2000 doimiy ravishda tashqi ish sharoitlarini real vaqtda kuzatib boradi va nosozlik tuzatilgandan so'ng avtomatik ravishda tiklanadi. 2. Agar signal tez-tez sodir bo'lsa va elektr stantsiyasining quvvat chiqishiga ta'sir qilsa, chiqishning qisqa tutashuvi sodir bo'maganini tekshirish kerak. Agar signal davom etsa, dileringizga yoki Huawei texnik yordamiga murojaat qilish tavsiya etiladi.

# alarm_name_2051
source: Abnormal Residual Current
ru_ru: Аномальный остаточный ток
uz_cyrl: Аномал қолдиқ оқим
uz_uz: Anomal qoldiq oqim

# alarm_cause_2051
source: The insulation impedance of the input side to PE decreases when the SUN2000 is operating.
ru_ru: Сопротивление изоляции входа относительно PE уменьшается во время работы SUN2000.
uz_cyrl: SUN2000 нинг ишлаши пайтида PEга нисбатан кириш изоляциясининг қаршилиги пасаяди.
uz_uz: SUN2000 ning ishlashi paytida PEga nisbatan kirish izolyatsiyasining qarshiligi pasayadi.

# alarm_suggestion_2051
source: 1. If the alarm occurs occasionally, the external circuit may be abnormal temporarily. The SUN2000 automatically recovers after the fault is rectified. 2. If the alarm occurs frequently or persists, check whether the impedance between the PV string and the ground is too low.
ru_ru: 1. Если сигнал тревоги возникает время от времени, внешняя цепь может быть временно неисправна. SUN2000 автоматически восстанавливается после устранения неисправности. 2. Если сигнал тревоги возникает часто или сохраняется, проверьте, не слишком ли низкое сопротивление между фотоэлектрической цепочкой и землей.
uz_cyrl: 1. Агар сигнал вақти-вақти билан рўй берса, ташқи занжир вақтинча ишламай қолган бўлиши мумкин ва SUN2000 носозлик бартараф этилгандан сўнг автоматик равишда тикланади. 2. Агар сигнал тез-тез рўй берса ёки сақланиб қолса, фотоэлектрик сим ва ер орасидаги қаршилик жуда паст эмаслигини текшириш керак.
uz_uz: 1. Agar signal vaqti-vaqti bilan ro'y bersa, tashqi zanjir vaqtincha ishlamay qolgan bo'lishi mumkin va SUN2000 nosozlik bartaraf etilgandan so'ng avtomatik ravishda tiklanadi. 2. Agar signal tez-tez ro'y bersa yoki saqlanib qolsa, fotoelektrik sim va yer orasidagi qarshilik juda past emasligini tekshirish kerak.

# alarm_name_2062
source: Low Insulation Resistance
ru_ru: Низкое сопротивление изоляции
uz_cyrl: Паст изоляция қаршилиги
uz_uz: Past izolyatsiya qarshiligi

# alarm_cause_2062
source: 1. A short circuit occurs between the PV array and the ground. 2. The ambient air of the PV array is damp and the insulation between the PV array and the ground is poor.
ru_ru: 1. Произошло короткое замыкание между фотоэлектрической батареей и землей. 2. Окружающий воздух фотоэлектрической батареи влажный, а изоляция между фотоэлектрической батареей и землей плохая.
uz_cyrl: 1. Фотоэлектрик батарея ва ер ўртасида қисқа туташув содир бўлади. 2. Фотоэлектрик батареянинг атроф-муҳит ҳавоси нам, фотоэлектрик батарея ва эр ўртасидаги изоляция эса ёмон.
uz_uz: 1. Fotoelektrik batareya va yer o'rtasida qisqa tutashuv sodir bo'ladi. 2. Fotoelektrik batareyaning atrof-muhit havosi nam, fotoelektrik batareya va er o'rtasidagi izolyatsiya esa yomon.

# alarm_suggestion_2062
source: 1. Check the output impedance of the PV array to ground. If there is a short circuit or lack of insulation, rectify it. 2. Check that the PE cable of the SUN2000 is correctly connected. 3. If the impedance is lower than the specified protection threshold in rainy and cloudy days, set Insulation resistance protection using the mobile app, SmartLogger, or NMS. 4. Current insulation resistance: x MΩ, possible short circuit position: x%. The short circuit position is valid for a single PV string. If there are multiple PV strings, check the PV strings one by one. For details, see Locating Insulation Resistance Faults.
ru_ru: 1. Проверьте выходное сопротивление фотоэлектрической батареи относительно земли. Если имеется короткое замыкание или отсутствие изоляции, устраните это. 2. Убедитесь, что кабель PE SUN2000 подключен правильно. 3. Если импеданс ниже указанного порога защиты в дождливые и пасмурные дни, установите защиту по сопротивлению изоляции с помощью мобильного приложения, SmartLogger или NMS. 4. Сопротивление изоляции по току: x МОм, возможное положение короткого замыкания: x MΩ. Положение короткого замыкания действительно для одной фотоэлектрической цепочки. Если имеется несколько строк PV, проверьте строки PV одну за другой. Подробную информацию см. в разделе «Обнаружение нарушений сопротивления изоляции».
uz_cyrl: 1. Фотоэлектрик батареянинг ерга чиқиш қаршилигини текширинг. Қисқа туташув ёки изоляция етишмаслиги аниқланса, буни тузатиш керак. 2. SUN2000 PE кабели тўғри уланганлигига ишонч ҳосил қилинг. 3. Агар ёмғирли ва булутли кунлар бўлса ёки импеданс белгиланган ҳимоя чегарасидан паст бўлса, Mobile APP, SmartLogger ёки Network Management System (NMS) ёрдамида изоляцияга қаршилик ҳимоясини ўрнатиш тавсия этилади. 4. Оқим изоляциясининг жорий қаршилиги: х МОм, мумкин бўлган қисқа туташув ҳолати: х%. Қисқа туташув ҳолати битта фотоэлектрик сим учун амал қилади. Агар тизим бир нечта фотоэлектрик қаторларини ўз ичига олса, ҳар бир фотоэлектрик қаторини алоҳида текширинг. Қўшимча маълумот олиш учун "Изоляция қаршилигининг бузилишини аниқлаш" бўлимига қаранг.
uz_uz: 1. Fotoelektrik batareyaning yerga chiqish qarshiligini tekshiring. Qisqa tutashuv yoki izolyatsiya yetishmasligi aniqlansa, buni tuzatish kerak. 2. SUN2000 PE kabeli to'g'ri ulanganligiga ishonch hosil qiling. 3. Agar yomg'irli va bulutli kunlar bo'lsa yoki impedans belgilangan himoya chegarasidan past bo'lsa, Mobile APP, SmartLogger yoki Network Management System (NMS) yordamida izolyatsiyaga qarshilik himoyasini o'rnatish tavsiya etiladi. 4. Oqim izolyatsiyasining joriy qarshiligi: x MOm, mumkin bo'lgan qisqa tutashuv holati: x%. Qisqa tutashuv holati bitta fotoelektrik sim uchun amal qiladi. Agar tizim bir nechta fotoelektrik qatorlarini o'z ichiga olsa, har bir fotoelektrik qatorini alohida tekshiring. Qo'shimcha ma'lumot olish uchun "Izolyatsiya qarshiligining buzilishini aniqlash" bo'limiga qarang.

# alarm_name_2063
source: Overtemperature
ru_ru: Перегрев
uz_cyrl: Қизиб кетган
uz_uz: Qizib ketgan

# alarm_cause_2063
source: 1. The SUN2000 is installed in a place with poor ventilation. 2. The ambient temperature is higher than the upper threshold. 3. The SUN2000 is not working properly.
ru_ru: 1. SUN2000 установлен в месте с плохой вентиляцией. 2. Температура окружающей среды выше верхнего порога. 3. SUN2000 работает неправильно.
uz_cyrl: 1. SUN2000 вентиляцияси ёмон бўлган жойга ўрнатилган. 2. Атроф-муҳит ҳарорати чегарадан юқори. 3. SUN2000 нотўғри ишламоқда.
uz_uz: 1. SUN2000 ventilyatsiyasi yomon bo'lgan joyga o'rnatilgan. 2. Atrof-muhit harorati chegaradan yuqori. 3. SUN2000 noto'g'ri ishlamoqda.

# alarm_suggestion_2063
source: 1. Check the ventilation and ambient temperature of the SUN2000 installation position. 2. If the ventilation is poor or the ambient temperature exceeds the upper threshold, improve the ventilation and heat dissipation. 3. If the ventilation and ambient temperature both meet requirements, contact your dealer or Huawei technical support.
ru_ru: 1. Проверьте вентиляцию и температуру окружающей среды в месте установки SUN2000. 2. Если вентиляция плохая или температура окружающей среды превышает верхний порог, улучшите вентиляцию и отвод тепла. 3. Если вентиляция и температура окружающей среды соответствуют требованиям, обратитесь к своему дилеру или в службу технической поддержки Huawei.
uz_cyrl: 1. SUN2000 ўрнатилган жойда вентиляция ва атроф-муҳит ҳароратини текширинг. 2. Агар вентиляция ёмон бўлса ёки атроф-муҳит ҳарорати юқори чегарадан ошса, шамоллатиш ва иссиқлик тарқалишини яхшиланг. 3. Агар вентиляция ва атроф-муҳит ҳарорати тўғри бўлса, дилерингизга ёки Huawei техник қўллаб-қувватлаш бўлимига мурожаат қилинг.
uz_uz: 1. SUN2000 o'rnatilgan joyda ventilyatsiya va atrof-muhit haroratini tekshiring. 2. Agar ventilyatsiya yomon bo'lsa yoki atrof-muhit harorati yuqori chegaradan oshsa, shamollatish va issiqlik tarqalishini yaxshilang. 3. Agar ventilyatsiya va atrof-muhit harorati to'g'ri bo'lsa, dileringizga yoki Huawei texnik qo'llab-quvvatlash bo'limiga murojaat qiling.

# alarm_name_2064
source: Device Fault
ru_ru: Неисправность устройства
uz_cyrl: Қурилманинг нотўғри ишлаши
uz_uz: Qurilmaning noto'g'ri ishlashi

# alarm_cause_2064
source: An unrecoverable fault has occurred on a circuit inside the SUN2000. Cause ID = 1–12 Cause ID 1: The Boost input is short-circuited. Cause ID 2: The Boost input experiences overcurrent. Cause ID 3: The control circuit is faulty. Cause ID 4: The SUN2000 circuit is abnormal. Cause ID 5: The residual current sensor is faulty. Cause ID 6: The temperature detection fails. Cause ID 7: EEPROM read/write fails. Cause ID 8: The auxiliary power supply is abnormal. Cause ID 9: The grid-tied relay is abnormal. Cause ID 10: The DC bus experiences overvoltage. Cause ID 11: The DC bus experiences undervoltage. Cause ID 12: The DC bus experiences voltage imbalance.
ru_ru: В цепи внутри SUN2000 произошла неисправимая неисправность. Идентификатор причины = 1–12. Идентификатор причины 1: Вход Boost закорочен. Идентификатор причины 2: На входе Boost наблюдается перегрузка по току. Идентификатор причины 3: Цепь управления неисправна. Идентификатор причины 4: Цепь SUN2000 неисправна. Код причины 5: Датчик остаточного тока неисправен. Идентификатор причины 6: Сбой определения температуры. Код причины 7: Ошибка чтения/записи EEPROM. Код причины 8: Неисправен вспомогательный источник питания. Идентификатор причины 9: Сетевое реле неисправно. Код причины 10: На шине постоянного тока наблюдается перенапряжение. Код причины 11: На шине постоянного тока наблюдается пониженное напряжение. Код причины 12: На шине постоянного тока наблюдается дисбаланс напряжения.
uz_cyrl: SUN2000 ичидаги занжирида тўғирланмайдиган носозлик юз берди. Сабаб ID = 1–12. Сабаб ID 1: Boostgга киритиш қисқартирилган. Сабаб ID 2: Boostgга киришда ҳаддан ташқари оқим мавжуд. Сабаб ID 3: Бошқарув занжири нотўғри. Сабаб ID 4: SUN2000 занжири нотўғри. Сабаб ID 5: Қолдиқ оқим сенсори нотўғри. Сабаб ID 6: Ҳарорат аниқлашда хато. Сабаб ID 7: EEPROM ўқиш/ёзиш хатоси. Сабаб ID 8: ёрдамчи қувват манбаи нотўғри. Сабаб ID 9: Тармоқ ўрни нотўғри. Сабаб ID 10: Ўзгармас ток шинасида ортиқча кучланиш кузатилди. Сабаб ID 11: Ўзгармас ток шинасида паст кучланиш кузатилди. Сабаб ID 12: Ўзгармас ток шинасида кучланиш номутаносиблиги кузатилди.
uz_uz: SUN2000 ichidagi zanjirida to'g'irlanmaydigan nosozlik yuz berdi. Sabab ID = 1–12. Sabab ID 1: Boostga kiritish qisqartirilgan. Sabab ID 2: Boostga kirishida haddan tashqari oqim mavjud. Sabab ID 3: Boshqaruv zanjiri noto'g'ri. Sabab ID 4: SUN2000 zanjiri noto'g'ri. Sabab ID 5: Qoldiq oqim sensori noto'g'ri. Sabab ID 6: Harorat aniqlashda xato. Sabab ID 7: EEPROM o'qish/yozish xatosi. Sabab ID 8: yordamchi quvvat manbai noto'g'ri. Sabab ID 9: Tarmoq o'rni noto'g'ri. Sabab ID 10: O'zgarmas tok shinasida ortiqcha kuchlanish kuzatildi. Sabab ID 11: O'zgarmas tok shinasida past kuchlanish kuzatildi. Sabab ID 12: O'zgarmas tok shinasida kuchlanish nomutanosibligi kuzatildi.
