Repository: maximzavzin22/solar_ios
Catalog: FusionSolar/*.lproj/Localizable.strings
Languages: ru_ru, uz_cyrl, uz_uz

# app_description
source: Smart PV for Future
ru_ru: Умный PV для будущего
uz_cyrl: Келажак учун ақлли PV
uz_uz: Kelajak uchun aqlli PV

# sign_in_username
source: Username
ru_ru: Имя пользователя
uz_cyrl: Фойдаланувчи исми
uz_uz: Foydalanuvchi ismi

# sign_in_password
source: Password
ru_ru: Пароль
uz_cyrl: Парол
uz_uz: Parol

source: Log In
ru_ru: Авторизоваться
uz_cyrl: Авторизация
uz_uz: Avtorizatsiya

source: Done
ru_ru: Готово
uz_cyrl: Тайёр
uz_uz: Tayyor

# language_title
source: Language
ru_ru: Язык
uz_cyrl: Тил
uz_uz: Til

source: Choose
ru_ru: Выбрать
uz_cyrl: Танлаш
uz_uz: Tanlash

# connection_error_title
source: Error
ru_ru: Ошибка при подключении
uz_cyrl: Уланишда хатолик
uz_uz: Ulanishda xatolik

# connection_error_description
source: We're sorry, server maintenance is underway.
ru_ru: Приносим свои извинения, ведутся технические работы на сервере.
uz_cyrl: Узр сўраймиз, серверда техник ишлар олиб борилмоқда.
uz_uz: Uzr so'raymiz, serverda texnik ishlar olib borilmoqda.

# auth_error_title
source: Authorization Error
ru_ru: Ошибка авторизации
uz_cyrl: Авторизация хатоси
uz_uz: Avtorizatsiya xatosi

# auth_error_description
source: This user was not found.
ru_ru: Данный пользователь не найден.
uz_cyrl: Ушбу фойдаланувчи топилмади.
uz_uz: Ushbu foydalanuvchi topilmadi.

source: Home
ru_ru: Дом
uz_cyrl: Уй
uz_uz: Uy

source: Objects
ru_ru: Объекты
uz_cyrl: Объектлар
uz_uz: Ob'ektlar

source: Maintenance
ru_ru: Обслуживание
uz_cyrl: Хизмат кўрсатиш
uz_uz: Xizmat ko'rsatish

source: Devices
ru_ru: Устройства
uz_cyrl: Қурилмалар
uz_uz: Qurilmalar

source: Me
ru_ru: Профиль
uz_cyrl: Профил
uz_uz: Profil

source: Plants
ru_ru: Станции
uz_cyrl: Станциялар
uz_uz: Stansiyalar

source: Statistics
ru_ru: Статистика
uz_cyrl: Статистика
uz_uz: Statistika

source: All
ru_ru: Все
uz_cyrl: Ҳаммаси
uz_uz: Hammasi

source: Normal
ru_ru: Нормально
uz_cyrl: Яхши
uz_uz: Yaxshi

source: Faulty
ru_ru: Поломка
uz_cyrl: Бузилган
uz_uz: Buzilgan

source: Offline
ru_ru: Не в сети
uz_cyrl: Офлайн
uz_uz: Oflayn

# platns_search
source: Enter a plant name.
ru_ru: Введите название.
uz_cyrl: Станция номини киритинг.
uz_uz: Stansiya nomini kiriting.

# no_data
source: No data available.
ru_ru: Нет данных.
uz_cyrl: Маълумот йўқ.
uz_uz: Maʼlumot yoʻq.

source: kWp
ru_ru: кВт
uz_cyrl: кВт
uz_uz: kVt

source: kWh
ru_ru: кВт⋅ч
uz_cyrl: кВт⋅с
uz_uz: kVt⋅s

source: Filter
ru_ru: Фильтр
uz_cyrl: Филтр
uz_uz: Filtr

source: MWp
ru_ru: МВт
uz_cyrl: МВт
uz_uz: MVt

# total_string_capacity
source: Total string capacity (kWp)
ru_ru: Общая вместимость
uz_cyrl: Занжирнинг умумий сиғими
uz_uz: Zanjirning umumiy sig'imi

source: Plant configuration
ru_ru: Конфигурация
uz_cyrl: Станция конфигурацияси
uz_uz: Stansiya konfiguratsiyasi

source: Optimizer
ru_ru: Оптимизатор
uz_cyrl: Оптимизатор
uz_uz: Optimizator

source: Battery
ru_ru: Батарея
uz_cyrl: Батарея
uz_uz: Batareya

source: Charger
ru_ru: Зарядка
uz_cyrl: Зарядлаш
uz_uz: Zaryadlash

source: Grid connection date
ru_ru: Дата подключения к сети
uz_cyrl: Тармоққа уланган сана
uz_uz: Tarmoqqa ulangan sana

source: Start time
ru_ru: С
uz_cyrl: дан
uz_uz: dan

source: End time
ru_ru: До
uz_cyrl: гача
uz_uz: gacha

source: Reset
ru_ru: Сбросить
uz_cyrl: Тиклаш
uz_uz: Tiklash

source: Confirm
ru_ru: Применить
uz_cyrl: Қўллаш
uz_uz: Qo'llash

source: Current power
ru_ru: Текущая мощность
uz_cyrl: Жорий қувват
uz_uz: Joriy quvvat

source: Revenue today
ru_ru: Доход сегодня
uz_cyrl: Даромад бугун
uz_uz: Daromad bugun

source: Yield today
ru_ru: Выработка сегодня
uz_cyrl: Ишлаб чиқариш бугун
uz_uz: Ishlab chiqarish bugun

source: Total yield
ru_ru: Общая выработка
uz_cyrl: Жами ишлаб чиқариш
uz_uz: Jami ishlab chiqarish

source: kW
ru_ru: кВт
uz_cyrl: кВт
uz_uz: kVt

source: MW
ru_ru: MВт
uz_cyrl: MВт
uz_uz: MVt

source: GW
ru_ru: ГВт
uz_cyrl: ГВт
uz_uz: GVt

source: Current plant ranking
ru_ru: Текущий рейтинг станций
uz_cyrl: Жорий станция рейтинги
uz_uz: Joriy stansiya reytingi

source: Environmental benefits
ru_ru: Экологические преимущества
uz_cyrl: Экологик афзалликлари
uz_uz: Ekologik afzalliklari

source: Standard coal saved
ru_ru: Стандартная экономия угля
uz_cyrl: Оддий кўмир тежалди
uz_uz: Oddiy ko'mir tejaldi

source: CO2 Reduced
ru_ru: CO2 снижено
uz_cyrl: CO2 камайди
uz_uz: CO2 kamaydi

source: Equivalent trees planted
ru_ru: Посажено эквивалентно деревьев
uz_cyrl: Эквивалент дарахтлар экилди
uz_uz: Ekvivalent daraxtlar ekildi

source: Yield Statistics
ru_ru: Статистика выработки
uz_cyrl: Ишлаб чиқариш статистикаси
uz_uz: Ishlab chiqarish statistikasi

source: Day
ru_ru: День
uz_cyrl: Кун
uz_uz: Kun

source: Month
ru_ru: Месяц
uz_cyrl: Ой
uz_uz: Oy

source: Year
ru_ru: Год
uz_cyrl: Йил
uz_uz: Yil

source: Lifetime
ru_ru: Всё время
uz_cyrl: Ҳар доим
uz_uz: Har doim

source: MWh
ru_ru: MВт⋅ч
uz_cyrl: MВт⋅с
uz_uz: MVt⋅s

source: GWh
ru_ru: ГВт⋅ч
uz_cyrl: ГВт⋅c
uz_uz: GVt⋅s

source: No data available.
ru_ru: Данные недоступны.
uz_cyrl: Маълумотлар мавжуд эмас.
uz_uz: Maʼlumotlar mavjud emas.

source: Cancel
ru_ru: Отмена
uz_cyrl: Бекор қилиш
uz_uz: Bekor qilish

source: OK
ru_ru: ОK
uz_cyrl: ОK
uz_uz: ОK

# storage_alarms
source: PV+Storage Alarms
ru_ru: PV+Тревоги
uz_cyrl: PV+Сигналлар
uz_uz: PV+Signallar

source: Alarms
ru_ru: Тревоги
uz_cyrl: Сигналлар
uz_uz: Signallar

source: Tasks
ru_ru: Задачи
uz_cyrl: Вазифалар
uz_uz: Vazifalar

# search_alarm
source: Enter an alarm name.
ru_ru: Введите название тревоги.
uz_cyrl: Сигнал учун ном киритинг.
uz_uz: Signal uchun nom kiriting.

source: Critical
ru_ru: Критических
uz_cyrl: Танқидий
uz_uz: Tanqidiy

source: Major
ru_ru: Серьёзных
uz_cyrl: Жиддий
uz_uz: Jiddiy

source: Minor
ru_ru: Низких
uz_cyrl: Кичик
uz_uz: Kichik

source: Warning
ru_ru: Извещений
uz_cyrl: Эслатма
uz_uz: Eslatma

source: Total
ru_ru: Всего
uz_cyrl: Жами
uz_uz: Jami

source: Unacked
uz_cyrl: Тасдиқланмаган
uz_uz: Tasdiqlanmagan

source: Defect Elimination Status
ru_ru: Статус устранения дефектов
uz_cyrl: Нуқсонларни бартараф этиш ҳолати
uz_uz: Nuqsonlarni bartaraf etish holati

source: Device name
ru_ru: Название устройства
uz_cyrl: Қурилма номи
uz_uz: Qurilma nomi

source: Plant name
ru_ru: Название установки
uz_cyrl: Станция номи
uz_uz: Stansiya nomi

source: Occurrence Time
ru_ru: Время появления
uz_cyrl: Кўриниш вақти
uz_uz: Ko'rinish vaqti

source: Name
ru_ru: Имя
uz_cyrl: Исм
uz_uz: Ism

source: SN
uz_cyrl: СР
uz_uz: SR

# seacrh_device_name
source: Enter a device name
ru_ru: Имя устройства
uz_cyrl: Қурилма номини топиш
uz_uz: Qurilma nomini topish

# seacrh_device_sn
source: Enter a device SN
ru_ru: SN устройства
uz_cyrl: Қурилманинг СР топиш
uz_uz: Qurilmaning SR topish

source: Running
ru_ru: Работает
uz_cyrl: Ишлайди
uz_uz: Ishlaydi

source: Device Type
ru_ru: Тип устройства
uz_cyrl: Қурилма тури
uz_uz: Qurilma turi

source: Warranty Expiration Date
ru_ru: Дата истечения гарантии
uz_cyrl: Кафолатнинг тугаш муддати
uz_uz: Kafolatning tugash muddati

source: Dongle
uz_cyrl: Донгл
uz_uz: Dongl

source: Inverter
uz_cyrl: Инвертор
uz_uz: Invertor

source: Inverter status
ru_ru: Статус инвертора
uz_cyrl: Инвертор ҳолати
uz_uz: Invertor holati

source: Active power
ru_ru: Активная мощность
uz_cyrl: Фаол қувват
uz_uz: Faol quvvat

source: Company info
ru_ru: Информация о компании
uz_cyrl: Компания ҳақида маълумот
uz_uz: Kompaniya haqida ma'lumot

source: About
ru_ru: О приложении
uz_cyrl: Илова ҳақида
uz_uz: Ilova haqida

source: Settings
ru_ru: Настройки
uz_cyrl: Созламалар
uz_uz: Sozlamalar

source: Account security
ru_ru: Безопасность аккаунта
uz_cyrl: Аккаунт хавфсизлиги
uz_uz: Akkaunt xavfsizligi

source: Account Deletion
ru_ru: Удаление учетной записи
uz_cyrl: Қайдномани ўчириш
uz_uz: Qaydnomani o'chirish

source: Log out
ru_ru: Выйти
uz_cyrl: Чиқиш
uz_uz: Chiqish

# log_out_question
source: Are you sure want to log out?
ru_ru: Вы уверены, что хотите выйти?
uz_cyrl: Чиқишга ишончингиз комилми?
uz_uz: Chiqishga ishonchingiz komilmi?

source: Exit
ru_ru: Выйти
uz_cyrl: Чиқиш
uz_uz: Chiqish

source: Inspection tasks
ru_ru: Контрольные
uz_cyrl: Текшириш
uz_uz: Tekshirish

source: Elimination tasks
ru_ru: На устранение
uz_cyrl: Бартараф этиш
uz_uz: Bartaraf etish

# search_task
source: Enter a task name.
ru_ru: Введите название задачи.
uz_cyrl: Вазифа номини киритинг.
uz_uz: Vazifa nomini kiriting.

source: Alarm details
ru_ru: Сведения о тревоге
uz_cyrl: Сигнал ҳақида маълумот
uz_uz: Signal haqida ma'lumot

# alarm_cause_id
source: Cause ID
ru_ru: ID причины
uz_cyrl: Сигнал сабаби ID
uz_uz: Signal sababi ID

# alarm_device_name
source: Device name
ru_ru: Имя устройства
uz_cyrl: Қурилма номи
uz_uz: Qurilma nomi

# alarm_device_type
source: Device Type
ru_ru: Тип устройства
uz_cyrl: Қурилма тури
uz_uz: Qurilma turi

# alarm_occurrence_time
source: Occurrence Time
ru_ru: Время
uz_cyrl: Сигнал вақти
uz_uz: Signal vaqti

source: Alarm ID
ru_ru: ID тревоги
uz_cyrl: Сигнал ID
uz_uz: Signal ID

# alarm_status
source: Status
ru_ru: Статус
uz_cyrl: Сигнал ҳолати
uz_uz: Signal holati

# alarm_severity
source: Severity
ru_ru: Серьезность
uz_cyrl: Сигналнинг жиддийлиги
uz_uz: Signalning jiddiyligi

# alarm_plant_name
source: Plant name
ru_ru: Имя установки
uz_cyrl: Сигналли станция номи
uz_uz: Signalli stansiya nomi

# alarm_сause
source: Alarm Cause
ru_ru: Причина
uz_cyrl: Сигнал сабаби
uz_uz: Signal sababi

source: Suggestions
ru_ru: Предложения
uz_cyrl: Таклифлар
uz_uz: Takliflar

source: Contact Person
ru_ru: Контактное лицо
uz_cyrl: Алоқадаги шахс
uz_uz: Aloqadagi shaxs

source: Contact method
ru_ru: Способ связи
uz_cyrl: Алоқа усули
uz_uz: Aloqa usuli

source: Plant address
ru_ru: Адрес станции
uz_cyrl: Станция манзили
uz_uz: Stansiya manzili

source: Overview
ru_ru: Просмотр
uz_cyrl: Кўриш
uz_uz: Ko'rish

source: Layout
ru_ru: Схема
uz_cyrl: Схема
uz_uz: Sxema

source: Plant details
ru_ru: Детали
uz_cyrl: Батафсил маълумот
uz_uz: Batafsil ma'lumot

source: Weather
ru_ru: Погода
uz_cyrl: Об-ҳаво
uz_uz: Ob-havo

source: Load
ru_ru: Нагрузка
uz_cyrl: Юк
uz_uz: Yuk

source: Grid
ru_ru: Сеть
uz_cyrl: Тармоқ
uz_uz: Tarmoq

# overview_yield_today
source: Yield today
ru_ru: Сегодня
uz_cyrl: Бугун
uz_uz: Bugun

# overview_revenue_today
source: Revenue today
ru_ru: Доход
uz_cyrl: Даромад
uz_uz: Daromad

source: Yield this month
ru_ru: В месяце
uz_cyrl: Ойига
uz_uz: Oyiga

source: Yield this year
ru_ru: В году
uz_cyrl: Йилига
uz_uz: Yiliga

# yield_this_total
source: Total yield
ru_ru: Всего
uz_cyrl: Жами
uz_uz: Jami

source: Energy Management
ru_ru: Управление энергией
uz_cyrl: Энергия бошқаруви
uz_uz: Energiya boshqaruvi

source: Yield
ru_ru: Cбор
uz_cyrl: Ишлаб чиқариш
uz_uz: Ishlab chiqarish

source: Full screen
ru_ru: Полный экран
uz_cyrl: Тўлиқ экран
uz_uz: To'liq ekran

source: Revenue
ru_ru: Доход
uz_cyrl: Даромад
uz_uz: Daromad

source: Total revenue
ru_ru: Общий доход
uz_cyrl: Умумий даромад
uz_uz: Umumiy daromad

source: Country/Region
ru_ru: Страна/регион
uz_cyrl: Мамлакат/минтақа
uz_uz: Mamlakat/mintaqa

source: Service provider
ru_ru: Поставщик услуг
uz_cyrl: Хизматлар таъминотчиси
uz_uz: Xizmatlar ta'minotchisi

source: Plant type
ru_ru: Тип станции
uz_cyrl: Станция тури
uz_uz: Stansiya turi

source: Charging-only plant
ru_ru: Зарядная установка
uz_cyrl: Зарядлаш станцияси
uz_uz: Zaryadlash stansiyasi

source: Start date of safe running
ru_ru: Дата начала работы
uz_cyrl: Ишнинг бошланиш санаси
uz_uz: Ishning boshlanish sanasi

# basic_plant_address
source: Plant address
ru_ru: Адрес
uz_cyrl: Манзил
uz_uz: Manzil

source: Plant time zone
ru_ru: Часовой пояс
uz_cyrl: Вақт минтақаси
uz_uz: Vaqt mintaqasi

source: Plant overview
ru_ru: Обзор установки
uz_cyrl: Станцияни кўриш
uz_uz: Stansiyani ko'rish

# map_critical
source: Сritical
ru_ru: Опасный
uz_cyrl: Танқидий
uz_uz: Tanqidiy

# map_major
source: Major
ru_ru: Главный
uz_cyrl: Жиддий
uz_uz: Jiddiy

# map_minor
source: Minor
ru_ru: Низкий
uz_cyrl: Кичик
uz_uz: Kichik

# map_warning
source: Warning
ru_ru: Извещение
uz_cyrl: Эслатма
uz_uz: Eslatma

# map_info_current_power
source: Current power
ru_ru: Текущая мощность
uz_cyrl: Жорий қувват
uz_uz: Joriy quvvat

# map_info_yield_today
source: Yield today
ru_ru: Cегодня
uz_cyrl: Бугун
uz_uz: Bugun

# map_info_total_string_capacity
source: Total string capacity
ru_ru: Общая вместимость
uz_cyrl: Умумий сиғими
uz_uz: Umumiy sig'imi

# map_info_plant_address
source: Plant address
ru_ru: Адрес
uz_cyrl: Манзил
uz_uz: Manzil

source: Select plant
ru_ru: Выберите объект
uz_cyrl: Объектни ўрнатинг
uz_uz: Ob'ektni o'rnating

source: Company name
ru_ru: Название компании
uz_cyrl: Компания номи
uz_uz: Kompaniya nomi

source: Address
ru_ru: Адрес
uz_cyrl: Манзил
uz_uz: Manzil

source: Website
ru_ru: Веб-сайт
uz_cyrl: Веб-сайт
uz_uz: Veb-sayt

source: Record number
ru_ru: Номер записи
uz_cyrl: Ёзув рақами
uz_uz: Yozuv raqami

# alarm_name_2001
source: High String Input Voltage
ru_ru: Высокое входное напряжение струны
uz_cyrl: Симнинг юқори кириш кучланиши
uz_uz: Simning yuqori kirish kuchlanishi

# alarm_cause_2001
source: The PV array is not properly configured. Excessive PV modules are connected in series to the PV string, and therefore the open-circuit voltage exceeds the maximum SUN2000 operating voltage. Cause ID = 1, 2 Cause ID 1: The PV1 input voltage is high. Cause ID 2: The PV2 input voltage is high.
ru_ru: Фотоэлектрический массив настроен неправильно. Слишком много фотоэлектрических модулей подключены последовательно к фотоэлектрической цепочке, поэтому напряжение холостого хода превышает максимальное рабочее напряжение SUN2000. Идентификатор причины = 1, 2 Идентификатор причины 1: Высокое входное напряжение PV1. Идентификатор причины 2: Высокое входное напряжение PV2.
uz_cyrl: Фотоэлектрик массиви нотўғри созланган. Ҳаддан ташқари фотоэлектрик модуллари фотоэлектрик симига кетма-кет уланган, бу эса очиқ электрон кучланишининг SUN2000 нинг максимал иш кучланишидан ошиб кетишига олиб келади. Сабаб ID = 1, 2 Сабаб ID 1: Фотоэлектрик 1 кириш кучланиши юқори. Сабаб ID 2: Фотоэлектрик 2 кириш кучланиши юқори.
uz_uz: Fotoelektrik massivi noto'g'ri sozlangan. Haddan tashqari fotoelektrik modullari fotoelektrik simiga ketma-ket ulangan, bu esa ochiq elektron kuchlanishining SUN2000 ning maksimal ish kuchlanishidan oshib ketishiga olib keladi. 1. Sabab ID = 1, 2 2. Sabab ID 1: Fotoelektrik 1 kirish kuchlanishi yuqori. 3. Sabab ID 2: Fotoelektrik 2 kirish kuchlanishi yuqori.

# alarm_suggestion_2001
source: Check the serial connection configuration of the PV string and ensure that the PV string open-circuit voltage is not greater than the maximum operating voltage of the SUN2000. After the PV array configuration is corrected, the alarm disappears.
ru_ru: Проверьте конфигурацию последовательного соединения фотоэлектрической цепочки и убедитесь, что напряжение холостого хода фотоэлектрической цепочки не превышает максимальное рабочее напряжение SUN2000. После исправления конфигурации фотоэлектрической группы аварийный сигнал исчезнет.
uz_cyrl: Фотоэлектрик симининг кетма-кет уланиш конфигурациясини текширинг ва фотоэлектрик симининг очиқ туташув кучланиши SUN2000 нинг максимал иш кучланишидан ошмаслигига ишонч ҳосил қилинг. Фотоэлектрик массиви конфигурацияси тузатилгандан сўнг, безовталик сигнали ёқолади.
uz_uz: Fotoelektrik simining ketma-ket ulanish konfiguratsiyasini tekshiring va fotoelektrik simining ochiq tutashuv kuchlanishi SUN2000 ning maksimal ish kuchlanishidan oshmasligiga ishonch hosil qiling. Fotoelektrik massivi konfiguratsiyasi tuzatilgandan so'ng, bezovtalik signali yo'qoladi.

# alarm_name_2002
source: DC Arc Fault
ru_ru: Дуговой отказ постоянного тока
uz_cyrl: Ўзгармас ток ёйи хатоси
uz_uz: O'zgarmas tok yoyi xatos

# alarm_cause_2002
source: The PV string power cables arc or are in poor contact. Cause ID = 1, 2 Cause ID 1: PV1 DC arc fault Cause ID 2: PV2 DC arc fault
ru_ru: Силовые кабели фотоэлектрической цепочки образуют дугу или имеют плохой контакт. Идентификатор причины = 1, 2 Идентификатор причины 1: Неисправность дуги постоянного тока PV1 Идентификатор причины 2: Ошибка дуги постоянного тока PV2
uz_cyrl: Фотоэлектрик симли қувват кабеллари ёй ёки ёмон алоқага эга. Сабаб ID = 1, 2 Сабаб ID 1: Фотоэлектрик 1 ўзгармас ток ёйи хатоси Сабаб ID 2: Фотоэлектрик 2 ўзгармас ток ёйи хатоси
uz_uz: Fotoelektrik simli quvvat kabellari yoy yoki yomon aloqaga ega. 1. Sabab ID = 1, 2 2. Sabab ID 1: Fotoelektrik 1 o'zgarmas tok yoyi xatosi 3. Sabab ID 2: Fotoelektrik 2 o'zgarmas tok yoyi xatosi

# alarm_suggestion_2002
source: Check whether the string cables arc or are in poor contact.
ru_ru: Проверьте, нет ли дуги в кабелях и нет ли у них плохого контакта.
uz_cyrl: Кабеллар учқун ёки ёмон алоқада эмаслигини текширинг.
uz_uz: Kabellar uchqun yoki yomon aloqada emasligini tekshiring.

# alarm_name_2003
source: DC Arc Fault
ru_ru: Дуговой отказ постоянного тока
uz_cyrl: Ўзгармас ток ёйи хатоси
uz_uz: O'zgarmas tok yoyi xatosi

# alarm_cause_2003
source: The PV string power cables arc or are in poor contact. (string-level fine detection) Cause ID 1: PV string 1 Cause ID 2: PV string 2 Cause ID 3: PV string 3
ru_ru: Силовые кабели фотоэлектрической цепочки дугообразны или имеют плохой контакт. (точное обнаружение на уровне цепочки) Идентификатор причины 1: строка PV 1 Идентификатор причины 2: строка PV 2 Идентификатор причины 3: строка PV 3
uz_cyrl: Фотоэлектрик симли қувват кабеллари ёй ёки ёмон алоқага эга. (қатор даражасида аниқ аниқлаш) Сабаб ID 1: қатор Фотоэлектрик 1 Сабаб ID 2: қатор Фотоэлектрик 2 Сабаб ID 3: қатор Фотоэлектрик 3
uz_uz: Fotoelektrik simli quvvat kabellari yoy yoki yomon aloqaga ega. (qator darajasida aniq aniqlash) 1. Sabab ID 1: qator Fotoelektrik 1 2. Sabab ID 2: qator Fotoelektrik 2 3.Sabab ID 3: qator Fotoelektrik 3

# alarm_suggestion_2003
source: Check whether the string cables arc or are in poor contact.
ru_ru: Проверьте, нет ли дуги в кабелях и нет ли у них плохого контакта.
uz_cyrl: Кабеллар учқун ёки ёмон алоқада эмаслигини текширинг.
uz_uz: Kabellar uchqun yoki yomon aloqada emasligini tekshiring.

# alarm_name_2011
source: String Reversed
ru_ru: Строка перевернута
uz_cyrl: Қатор айлантирилган
uz_uz: Qator aylantirilgan

# alarm_cause_2011
source: The PV string is reversely connected. 1. PV1 is reversely connected. 2. PV2 is reversely connected.
ru_ru: PV-цепь подключена обратно. 1. PV1 подключен обратно. 2. PV2 подключен обратно.
uz_cyrl: Фотоэлектрик сим қайта уланган. Сабаб ID = 1, 2 Сабаб ID 1: Фотоэлектрик 1 тўғри уланмаган. Сабаб ID 2: Фотоэлектрик 2 тўғри уланмаган.
uz_uz: Fotoelektrik sim qayta ulangan. Sabab ID = 1, 2 1. Sabab ID 1: Fotoelektrik 1 to'g'ri ulanmagan. 2. Sabab ID 2: Fotoelektrik 2 to'g'ri ulanmagan.

# alarm_suggestion_2011
source: Check whether the PV string is reversely connected to the SUN2000. If yes, wait until the PV string current decreases below 0.5 A, set DC switch to OFF, and adjust the PV string polarity.
ru_ru: Проверьте, обратно ли подключена фотоэлектрическая цепочка к SUN2000. Если да, подождите, пока ток фотоэлектрической цепочки не упадет ниже 0,5 А, установите переключатель постоянного тока в положение ВЫКЛ и отрегулируйте полярность фотоэлектрической цепочки.
uz_cyrl: Фотоэлектрик сими SUN2000 га қайта уланганлигини текширинг. Агар у уланган бўлса, Фотоэлектрик симининг оқими 0,5А дан пастга тушгунча кутинг, сўнгра ўзгармас токнинг тугмачасини ЎЧИК ҳолатига ўрнатинг ва фотоэлектрик симининг қутбланишини созланг.
uz_uz: Fotoelektrik simi SUN2000 ga qayta ulanganligini tekshiring. Agar u ulangan bo'lsa, Fotoelektrik simining oqimi 0,5A dan pastga tushguncha kuting, so'ngra o'zgarmas tokning tugmachasini O'CHIK holatiga o'rnating va Fotoelektrik simining qutblanishini sozlang.

# alarm_name_2012
source: String Current Backfeed
ru_ru: Обратная подача тока строки
uz_cyrl: Тармоқли оқимнинг тескари таъминоти
uz_uz: Tarmoqli oqimning teskari ta'minot

# alarm_cause_2012
source: The number of PV modules connected in series to the PV string is insufficient. As a result, the end voltage is lower than that of other strings. Cause ID 1–4: PV strings 1–4
ru_ru: Количество фотоэлектрических модулей, последовательно подключенных к фотоэлектрической цепочке, недостаточно. В результате конечное напряжение ниже, чем у других цепочек. Идентификатор причины 1–4: PV-строки 1–4
uz_cyrl: Фотоэлектрик симига кетма-кет уланган фотоэлектрик модулларининг сони етарли эмас. Натижада, якуний таранглик бошқа симларга қараганда паст бўлади. Сабаб ID 1–4: Фотоэлектрик қаторлари 1–4.
uz_uz: Fotoelektrik simiga ketma-ket ulangan fotoelektrik modullarining soni yetarli emas. Natijada, yakuniy taranglik boshqa simlarga qaraganda past bo'ladi. Sabab ID 1–4: Fotoelektrik qatorlari 1–4.

# alarm_suggestion_2012
source: 1. Check whether the number of PV modules connected in series to this PV string is less than the number of PV modules connected in series to the other PV strings connected in parallel with this PV string. If yes, wait until the PV string current drops below 0.5 A, set the DC switch to OFF, and adjust the number of PV modules in the PV string. 2. Check whether the PV string is shaded. 3. Check whether the open-circuit voltage of the PV string is normal.
ru_ru: 1. Проверьте, меньше ли количество фотоэлектрических модулей, подключенных последовательно к этой фотоэлектрической цепочке, чем количество фотоэлектрических модулей, подключенных последовательно к другим фотоэлектрическим цепочкам, подключенным параллельно к этой фотоэлектрической цепочке. Если да, подождите, пока ток фотоэлектрической цепочки упадет ниже 0,5 А, установите переключатель постоянного тока в положение ВЫКЛ и отрегулируйте количество фотоэлектрических модулей в фотоэлектрической цепочке. 2. Проверьте, затенена ли строка PV. 3. Проверьте, в норме ли напряжение холостого хода фотоэлектрической цепочки.
uz_cyrl: 1. Ушбу фотоэлектрик қаторига кетма-кет уланган фотоэлектрик модуллари сони ушбу фотоэлектрик қаторига параллел равишда уланган бошқа фотоэлектрик қаторларига кетма-кет уланган фотоэлектрик модуллари сонидан камроқ эканлигини текширинг. Агар шундай бўлса, фотоэлектрик симли оқими 0,5А дан пастга тушгунча кутинг, сўнгра ўзгармас ток тугмачасини ЎЧИК ҳолатига ўтказинг ва фотоэлектрик симидаги фотоэлектрик модуллар сонини созланг. 2. Фотоэлектрик қатори бўялганлигини текширинг 3. Фотоэлектрик симнинг очиқ туташув кучланиши нормал ҳолатдалигини текширинг.
uz_uz: 1. Ushbu fotoelektrik qatoriga ketma-ket ulangan fotoelektrik modullari soni ushbu fotoelektrik qatoriga parallel ravishda ulangan boshqa fotoelektrik qatorlariga ketma-ket ulangan fotoelektrik modullari sonidan kamroq ekanligini tekshiring. Agar shunday bo'lsa, fotoelektrik simli oqimi 0,5A dan pastga tushguncha kuting, so'ngra o'zgarmas tok tugmachasini O'CHIK holatiga o'tkazing va fotoelektrik simidagi fotoelektrik modullar sonini sozlang. 2. Fotoelektrik qatori bo'yalganligini tekshiring 3. Fotoelektrik simning ochiq tutashuv kuchlanishi normal holatdaligini tekshiring.

# alarm_name_2013
source: Abnormal string power
ru_ru: Аномальная мощность струны
uz_cyrl: Симнинг аномал кучи
uz_uz: Simning anomal kuchi

# alarm_cause_2013
source: 1. The PV string is shaded for a long time. 2. The PV string is aged abnormally. Cause ID 1–4: PV strings 1–4
ru_ru: 1. Строка PV затенена в течение длительного времени. 2. Фотоэлектрическая цепочка имеет ненормальный возраст. Идентификатор причины 1–4: PV-строки 1–4
uz_cyrl: 1. Фотоэлектрик қатори узоқ вақт давомида бўялган. 2. Фотоэлектрик тармоқ ғайритабиий равишда эскирган. Сабаб ID 1–4: Фотоэлектрик қаторлари 1–4.
uz_uz: 1. Fotoelektrik qatori uzoq vaqt davomida bo'yalgan. 2. Fotoelektrik tarmoq g'ayritabiiy ravishda eskirgan. Sabab ID 1–4: Fotoelektrik qatorlari 1–4.
