Repository: maximzavzin22/solar_ios
Catalog: FusionSolar/*.lproj/Localizable.strings
Languages: ru_ru, uz_cyrl, uz_uz

# alarm_cause_2092
source: 1. The CT installation phase or direction is incorrect. 2. The CT cable is disconnected.
ru_ru: 1. Неправильная фаза или направление установки трансформатора тока. 2. Кабель трансформатора тока отсоединен.
uz_cyrl: 1. Ток трансформаторининг фазаси ёки ўрнатиш йўналиши нотўғри. 2. CТ кабели уланмаган
uz_uz: 1. Tok transformatorining fazasi yoki o'rnatish yo'nalishi noto'g'ri. 2. CT kabeli ulanmagan

# alarm_suggestion_2092
source: 1. Check whether the CT installation direction is correct. 2. Check whether the CT installation phase is correct. 3. Check whether the cable from the CT to the SUN2000 is disconnected.
ru_ru: 1. Проверьте правильность направления установки трансформатора тока. 2. Проверьте правильность этапа установки трансформатора тока. 3. Проверьте, не отсоединен ли кабель от трансформатора тока к SUN2000.
uz_cyrl: 1. Ток трансформаторининг ўрнатиш йўналиши тўғри эканлигини текширинг. 2. Ток трансформаторининг ўрнатиш босқичи тўғрилигини текширинг. 3. Кабел ток трансформаторидан SUN2000 га уланмаганлигини текширинг.
uz_uz: 1. Tok transformatorining o'rnatish yo'nalishi to'g'ri ekanligini tekshiring. 2. Tok transformatorining o'rnatish bosqichi to'g'riligini tekshiring. 3. Kabel tok transformatoridan SUN2000 ga ulanmaganligini tekshiring.

# alarm_name_2093
source: DC Switch Abnormal
ru_ru: Неисправность переключателя постоянного тока
uz_cyrl: Ўзгармас ток ўчиргичи нормал ҳолатда эмас
uz_uz: O'zgarmas tok o'chirgichi normal holatda emas

# alarm_cause_2093
source: The DC switches are not switched on, and the DC switch reset buttons are not fully pressed.
ru_ru: Выключатели постоянного тока не включены, а кнопки сброса переключателей постоянного тока нажаты не полностью.
uz_cyrl: Ўзгармас токнинг ўчиргичлари ёқилмаган, ўзгармас токнинг тиклаш тугмалари эса тўлиқ босилмаган.
uz_uz: O'zgarmas tokning o'chirgichlari yoqilmagan, o'zgarmas tokning tiklash tugmalari esa to'liq bosilmagan.

# alarm_suggestion_2093
source: Check whether all DC switches are in the ON position. If not, turn the switches to the ON position (you can rotate the switches to ensure that they are in position). If the switch still cannot be turned to ON, press the reset buttons of all DC switches inwards until they cannot be moved, and then turn on the DC switches again.
ru_ru: Проверьте, все ли переключатели постоянного тока находятся в положении ВКЛ. Если нет, переведите переключатели в положение ВКЛ (вы можете повернуть переключатели, чтобы убедиться, что они находятся в правильном положении). Если переключатель по-прежнему не может быть включен в положение ВКЛ. , нажмите кнопки сброса всех выключателей постоянного тока внутрь до тех пор, пока их невозможно будет переместить, а затем снова включите выключатели постоянного тока.
uz_cyrl: Барча ўзгармас токнинг ўчиргичлари ЁҚИҚ ҳолатида эканлигини текширинг. Агар ундай бўлмаса, ўчиргичларни "ЁҚИҚ" ҳолатига ўтказинг (тўғри ҳолатда эканлигига ишонч ҳосил қилиш учун ўчиргичларни айлантиришингиз мумкин). Агар ўчиргични ҳали ҳам "ЁҚИҚ" ҳолатига ўтказишни иложи бўлмаса, ўзгармас токнинг барча тиклаш тугмаларини уларни кўчириш мумкин бўлмаган ҳолатигача ичкарига босинг, кейин эса ўзгармас токнинг ўчиргичларини қайта ёқинг.
uz_uz: Barcha o'zgarmas tokning o'chirgichlari YOQIQ holatida ekanligini tekshiring. Agar unday bo'lmasa, o'chirgichlarni "YOQIQ" holatiga o'tkazing (to'g'ri holatda ekanligiga ishonch hosil qilish uchun o'chirgichlarni aylantirishingiz mumkin). Agar o'chirgichni hali ham "YOQIQ" holatiga o'tkazishni iloji bo'lmasa, o'zgarmas tokning barcha tiklash tugmalarini ularni ko'chirish mumkin bo'lmagan holatigacha ichkariga bosing, keyin esa o'zgarmas tokning o'chirgichlarini qayta yoqing.

# alarm_name_2094
source: The remaining dischargeable capacity of the battery is low.
ru_ru: Остаток разрядной емкости аккумулятора низкий.
uz_cyrl: Батареянинг қолган зарядсизланиш қуввати паст.
uz_uz: Batareyaning qolgan zaryadsizlanish quvvati past.

# alarm_cause_2094
source: The remaining dischargeable capacity of the battery is lower than 10% of the total capacity in off-grid scenario.
ru_ru: Оставшаяся разряжаемая емкость аккумулятора ниже 10 % от общей емкости в автономном режиме.
uz_cyrl: Қолган зарядсизланадиган батарея қуввати автоном режимда батареянинг умумий ҳажмининг 10% дан камини ташкил қилмоқда.
uz_uz: Qolgan zaryadsizlanadigan batareya quvvati avtonom rejimda batareyaning umumiy hajmining 10% dan kamini tashkil qilmoqda.

# alarm_suggestion_2094
source: The remaining power of the battery is low. Please remove unnecessary loads to increase power backup duration.
ru_ru: Оставшийся заряд батареи низкий. Пожалуйста, отключите ненужную нагрузку, чтобы увеличить продолжительность резервного питания.
uz_cyrl: Қолган батарея қуввати кам. Илтимос, захира қувват муддатини ошириш учун кераксиз юкларни ўчириб ташланг.
uz_uz: Qolgan batareya quvvati kam. Iltimos, zaxira quvvat muddatini oshirish uchun keraksiz yuklarni o'chirib tashlang.

# alarm_name_999999999
source: Abnormal communication between management system and equipment
ru_ru: Ненормальная связь между системой управления и оборудованием
uz_uz: Бошқарув тизими ва ускуналар ўртасидаги ғайритабиий алоқа

# alarm_cause_999999999
source: Abnormal communication between management system and equipment
ru_ru: Ненормальная связь между системой управления и оборудованием
uz_uz: Бошқарув тизими ва ускуналар ўртасидаги ғайритабиий алоқа

# alarm_suggestion_999999999
source: Scenario 1: device connection through a network cable. 1. Check whether the network and cable connection of the router are normal. 2. Check whether the router network can access the public network. Scenario 2:device connection through WiFi. 1. Check whether the router password is changed or the signal strength is weak. 2. Check whether the router network can access the public network. Scenario 3:device connection through a 4G network. Check whether the SIM card is inserted improperly or in arrears, or its network is abnormal. Scenario 4: Equipment side system power outage. please check if the equipment power has been restored.
ru_ru: Сценарий 1: подключение устройства через сетевой кабель. 1. Проверьте, в порядке ли сеть и кабельное соединение маршрутизатора. 2. Проверьте, может ли сеть маршрутизатора получить доступ к общедоступной сети. Сценарий 2: подключение устройства через Wi-Fi. 1. Проверьте, не изменен ли пароль маршрутизатора или слаб ли уровень сигнала. 2. Проверьте, может ли сеть маршрутизатора получить доступ к общедоступной сети. Сценарий 3: подключение устройства через сеть 4G. Проверьте, не вставлена ли SIM-карта неправильно или запаздывает, или ее сеть ненормальна. Сценарий 4: Отключение электропитания системы на стороне оборудования. пожалуйста, проверьте, восстановлено ли питание оборудования.
uz_uz: 1-сценарий: тармоқ кабели орқали қурилма уланиши. 1. Роутернинг тармоқ ва кабел алоқаси нормал ёки йўқлигини текширинг. 2. Роутер тармоғи умумий тармоққа кира оладими ёки йўқлигини текширинг. Сценарий 2: Wи-Фи орқали қурилма уланиши. 1. Роутер пароли ўзгарганлигини ёки сигнал кучсизлигини текширинг. 2. Роутер тармоғи умумий тармоққа кира оладими ёки йўқлигини текширинг. Сценарий 3: 4Г тармоғи орқали қурилма уланиши. СИМ-карта нотўғри ўрнатилганми ёки кечиктирилганми ёки унинг тармоғи анормал еканлигини текширинг. Сценарий 4: Ускунанинг ён тизимидаги електр қувватининг узилиши. Илтимос, ускунанинг қуввати тикланганлигини текширинг.

# alarm_name_2061
source: Abnormal Grounding
ru_ru: Аномальное заземление
uz_uz: Ғайритабиий топраклама

# alarm_cause_2061
source: 1. The neutral wire or PE cable of the device is not connected. 2. The output mode set for the device does not match the actual cable connection.
ru_ru: 1. Нейтральный провод или PE-кабель устройства не подключен. 2. Установленный для устройства режим вывода не соответствует фактическому подключению кабеля.
uz_uz: 1. Қурилманинг нейтрал сими ёки ПЕ кабели уланмаган. 2. Қурилма учун ўрнатилган чиқиш режими ҳақиқий кабел уланишига мос келмайди.

# alarm_suggestion_2061
source: Power off the device (turn off the AC switch and DC switch, and wait for a period specified on the device safety warning label), and then perform the following operations: 1. Check that the PE cable of the device is connected properly. 2. If the device is connected to a TN power grid, check whether the neutral wire is properly connected and whether the voltage to ground is normal. 3. After powering on the device, check whether the output mode set on the device matches the actual cable connection.
ru_ru: Выключите устройство (выключите выключатель переменного и постоянного тока и подождите период, указанный на этикетке с предупреждением о безопасности устройства), а затем выполните следующие операции: 1. Убедитесь, что кабель PE устройства подключен правильно. 2. Если устройство подключено к сети TN, проверьте правильность подключения нейтрального провода и нормальное ли напряжение относительно земли. 3. После включения устройства проверьте, соответствует ли режим вывода, установленный на устройстве, фактическому подключению кабеля.
uz_uz: Қурилмани ўчиринг (AC ва ДC калитини ўчиринг ва қурилма хавфсизлиги огоҳлантириш ёрлиғида кўрсатилган вақтни кутинг) ва кейин қуйидаги амалларни бажаринг: 1. Қурилманинг ПЕ кабели тўғри уланганлигини текширинг. 2. Aгар қурилма ТН електр тармоғига уланган бўлса, нейтрал симнинг тўғри уланганлигини ва ерга кучланиш нормал ёки йўқлигини текширинг. 3. Қурилмани ёққанингиздан сўнг, қурилмада ўрнатилган чиқиш режими ҳақиқий кабел уланишига мос келишини текширинг.

source: t
ru_ru: т
uz_cyrl: т
