Repository: maximzavzin22/solar_ios
Catalog: FusionSolar/*.lproj/Localizable.strings
Languages: ru_ru, uz_cyrl, uz_uz

# alarm_suggestion_2013
source: 1. Check whether the PV string current is obviously lower than the currents of other PV strings. 2. If the PV string current is obviously low, check whether the PV string is shaded. 3. If the PV string is clean and not shielded from sunlight, check whether any PV module is faulty
ru_ru: 1. Проверьте, явно ли ток фотоэлектрической цепочки ниже, чем токи других фотоэлектрических цепочек. 2. Если ток фотоэлектрической цепочки явно низкий, проверьте, затенена ли фотоэлектрическая цепочка. 3. Если фотоэлектрическая цепочка чистая и не защищена от солнечного света, проверьте, не неисправен ли какой-либо фотоэлектрический модуль
uz_cyrl: 1. Фотоэлектрик симининг оқими бошқа фотоэлектрик симларининг оқимларидан сезиларли даражада паст эмаслигини текширинг. 2. Агар фотоэлектрик симининг оқими аниқ даражада паст бўлса, фотоэлектрик симида соя бор-йўқлигини текширинг. 3. Агар фотоэлектрик сими очиқ жойда бўлса ва қуёш нурларидан ҳимояланмаган бўлса, қандайдир фотоэлектрик модули носоз эмаслигини текширинг.
uz_uz: 1. Fotoelektrik simining oqimi boshqa fotoelektrik simlarining oqimlaridan sezilarli darajada past emasligini tekshiring. 2. Agar fotoelektrik simining oqimi aniq darajada past bo'lsa, fotoelektrik simida soya bor-yo'qligini tekshiring. 3. Agar fotoelektrik simi ochiq joyda bo'lsa va quyosh nurlaridan himoyalanmagan bo'lsa, qandaydir fotoelektrik moduli nosoz emasligini tekshiring.

# alarm_name_2014
source: High Input String Voltage to Ground
ru_ru: Высокое напряжение входной цепи относительно земли
uz_cyrl: Занжирнинг ерга нисбатан юқори кириш кучланиши
uz_uz: Zanjirning yerga nisbatan yuqori kirish kuchlanishi

# alarm_cause_2014
source: The voltage between the input PV modules and the ground is abnormal, and there is a risk of power degradation.
ru_ru: Напряжение между входными фотоэлектрическими модулями и землей ненормальное, и существует риск снижения мощности.
uz_cyrl: Кириш фотоэлектрик модуллари ва ер орасидаги кучланиш нормал ҳолатда эмас ва қувватни йўқотиш хавфи мавжуд.
uz_uz: Kirish fotoelektrik modullari va yer orasidagi kuchlanish normal holatda emas va quvvatni yo'qotish xavfi mavjud.

# alarm_suggestion_2014
source: 1. If the system does not have PID compensation devices, disable the PID protection. Note that enabling the reactive power compensation at night even when the PID protection is disabled brings risks of PV module degradation. 2. If the system has a PID compensation device, check whether the device is abnormal. If yes, rectify the fault. 3. Check whether the settings of compensation direction for the SUN2000 and the PID device are consistent. If not, set them to be consistent based on the PV module model. (Note: If the PV– is set to positive offset, the voltage between the SUN2000 PV– and the ground should be greater than 0 V to clear the alarms; if the PV+ is set to negative offset, the voltage between the SUN2000 PV+ and the ground should be less than 0 V to clear the alarms.) 4. If the fault occurs repeatedly, contact your dealer or Huawei technical support.
ru_ru: 1. Если в системе нет устройств ПИД-компенсации, отключите ПИД-защиту. Обратите внимание, что включение компенсации реактивной мощности в ночное время, даже когда ПИД-защита отключена, приводит к риску деградации фотоэлектрического модуля. 2. Если в системе имеется устройство ПИД-компенсации, проверьте, не неисправно ли это устройство. Если да, устраните неисправность. 3. Проверьте, совпадают ли настройки направления компенсации для SUN2000 и устройства ПИД. Если нет, установите их согласованность в зависимости от модели фотоэлектрического модуля. (Примечание. Если для PV– установлено положительное смещение, напряжение между SUN2000 PV– и землей должно быть больше 0 В, чтобы сбросить аварийные сигналы; если для PV+ установлено отрицательное смещение, напряжение между SUN2000 PV+ и землей должно быть больше 0 В. для сброса сигналов тревоги заземление должно быть меньше 0 В.) 4. Если неисправность повторяется, обратитесь к дилеру или в службу технической поддержки Huawei.
uz_cyrl: 1. Агар тизимда ПИД компенсатсия қурилмалари бўлмаса, ПИД ҳимоясини ўчириш тавсия этилади. Эътибор беринг, реактив қувват компенсатсиясини тунда ёқиш, ҳатто ПИД ҳимояси ўчирилган бўлса ҳам, фотоелектрик модулининг бузилиши хавфига олиб келиши мумкин. 2. Тизимда ПИД компенсация мосламаси мавжуд бўлса, уни носозликлар мавжуд эмаслигига текшириш керак. Агар носозликлар мавжуд бўлса, уларни бартараф этиш керак. 3. Шунингдек, SUN2000 ва ПИД қурилмаси учун компенсация йўналиши созламалари бир хил ёки йўқлигини текширишингиз керак. Агар созламалар мос келмаса, улар фотоелектрик модули моделига мувофиқ созланиши керак. (Эслатма: Агар фотоэлектрик – мусбат йўналишга ўрнатилган бўлса, сигналларни қайта ўрнатиш учун SUN2000 фотоэлектрик – ва ер орасидаги кучланиш 0V дан катта бўлиши керак; агар фотоэлектрик+ манфий йўналишга ўрнатилган бўлса, SUN2000 Фотоэлектрик+ ва ер орасидаги кучланиш 0 V дан катта бўлиши керак. Сигналларни қайта ўрнатиш учун 0 V, ер 0 V дан кам бўлиши керак.) 4. Агар хато қайта-қайта такрорланса, дилерингизга ёки Huawei техник ёрдамига мурожаат қилишингизни тавсия қиламиз.
uz_uz: 1. Agar tizimda PID kompensatsiya qurilmalari bo'lmasa, PID himoyasini o'chirish tavsiya etiladi. E'tibor bering, reaktiv quvvat kompensatsiyasini tunda yoqish, hatto PID himoyasi o'chirilgan bo'lsa ham, fotoelektrik modulining buzilishi xavfiga olib kelishi mumkin. 2. Tizimda PID kompensatsiya moslamasi mavjud bo'lsa, uni nosozliklar mavjud emasligiga tekshirish kerak. Agar nosozliklar mavjud bo'lsa, ularni bartaraf etish kerak. 3. Shuningdek, SUN2000 va PID qurilmasi uchun kompensatsiya yo'nalishi sozlamalari bir xil yoki yo'qligini tekshirishingiz kerak. Agar sozlamalar mos kelmasa, ular fotoelektrik moduli modeliga muvofiq sozlanishi kerak. (Eslatma: Agar fotoelektrik – musbat yoʻnalishga oʻrnatilgan boʻlsa, signallarni qayta oʻrnatish uchun SUN2000 fotoelektrik – va yer orasidagi kuchlanish 0 V dan katta boʻlishi kerak; agar Fotoelektrik+ manfiy yoʻnalishga oʻrnatilgan boʻlsa, SUN2000 Fotoelektrik+ va yer orasidagi kuchlanish 0 V dan katta boʻlishi kerak. Signallarni qayta o'rnatish uchun 0 V, yer 0 V dan kam bo'lishi kerak.) 4. Agar xato qayta-qayta takrorlansa, dileringizga yoki Huawei texnik yordamiga murojaat qilishingizni tavsiya qilamiz.

# alarm_name_2015
source: PV String Loss
ru_ru: Потеря PV-строки
uz_cyrl: Фотоэлектрик қаторни йўқотиш
uz_uz: Fotoelektrik qatorni yo'qotish

# alarm_cause_2015
source: This alarm is generated when the PV string status is abnormal due to the following conditions: a single PV string is lost; both 2-in-1 PV strings are lost; one of the 2-in-1 PV strings is lost.
ru_ru: Этот сигнал тревоги генерируется, когда состояние PV-строки является ненормальным из-за следующих условий: потеря одной PV-цепи; потеря обеих PV-цепочек 2-в-1; одна из PV-цепочек 2-в-1 потерян.
uz_cyrl: Ушбу сигнал фотоэлектрик симнинг ҳолати қуйидаги ҳолатлар туфайли нормал бўлмаган ҳолга келганда ҳосил бўлади: Фотоэлектрик симлардан бирининг йўқолиши; иккала 2-таси-1 фотоэлектрик симлар йўқолиши; 2-таси-1 фотоэлектрик симлардан бири йўқолиши.
uz_uz: Ushbu signal fotoelektrik simning holati quyidagi holatlar tufayli normal bo'lmagan holga kelganda hosil bo'ladi: Fotoelektrik simlardan birining yo'qolishi; ikkala 2-tasi-1 fotoelektrik simlar yo'qolishi; 2-tasi-1 fotoelektrik simlardan biri yo'qolishi

# alarm_suggestion_2015
source: 1. Check whether the SUN2000 terminals are properly connected. 2. Check whether the PV string terminals are properly connected. 3. If a 2-in-1 terminal is used, check whether it is normal. Note: If the string connection status is manually configured, check whether the configured status is consistent with the actual connection status.
ru_ru: 1. Проверьте, правильно ли подключены клеммы SUN2000. 2. Проверьте, правильно ли подключены клеммы фотоэлектрической цепочки. 3. Если используется терминал 2-в-1, проверьте его исправность. Примечание. Если статус строкового соединения настроен вручную, проверьте, соответствует ли настроенный статус фактическому статусу соединения.
uz_cyrl: 1. SUN2000 терминаллари тўғри уланганлигини текширинг. 2. Фотоэлектрик симли терминаллари тўғри уланганлигини текширинг. 3. Агар 2-таси-1 терминалидан фойдаланилаётган бўлинса, унинг тўғри ишлашини текширинг. Эслатма: Агар қаторли уланиш ҳолати қўлда созланган бўлса, созланган ҳолат ҳақиқий уланиш ҳолатига мос эканлигини текширинг.
uz_uz: 1. SUN2000 terminallari to'g'ri ulanganligini tekshiring. 2. Fotoelektrik simli terminallari to'g'ri ulanganligini tekshiring. 3. Agar 2-tasi-1 terminalidan foydalanilayotgan bo'linsa, uning to'g'ri ishlashini tekshiring. Eslatma: Agar qatorli ulanish holati qo'lda sozlangan bo'lsa, sozlangan holat haqiqiy ulanish holatiga mos ekanligini tekshiring.

# alarm_name_2021
source: AFCI Check Failure
ru_ru: Ошибка проверки AFCI
uz_cyrl: AFCI текшируви хатоси
uz_uz: AFCI tekshiruvi xatosi

# alarm_cause_2021
source: The AFCI check fails. 1. The AFCI check circuit is abnormal. 2. The AFCI circuit is faulty.
ru_ru: Проверка AFCI не удалась. 1. Схема проверки AFCI неисправна. 2. Цепь AFCI неисправна.
uz_cyrl: AFCI текшируви амалга ошмади. Сабаб ID = 1, 2 Сабаб ID 1: AFCI текширув схемаси нотўғри. Сабаб ID 2: AFCI сими нотўғри.
uz_uz: AFCI tekshiruvi amalga oshmadi. Sabab ID = 1, 2 Sabab ID 1: AFCI tekshiruv sxemasi noto'g'ri. Sabab ID 2: AFCI simi noto'g'ri.

# alarm_suggestion_2021
source: Turn off the AC output switch and DC input switch, and then turn them on after 5 minutes. If the alarm persists, contact your dealer or Huawei technical support.
ru_ru: Выключите выходной переключатель переменного тока и входной переключатель постоянного тока, а затем включите их через 5 минут. Если сигнал тревоги не исчезнет, обратитесь к своему дилеру или в службу технической поддержки Huawei.
uz_cyrl: Ўзгарувчан токнинг чиқиш ўчиргичи ва ўзгармас токнинг кириш ўчиргичини ўчиринг, ва 5 дақиқадан сўнг уларни ёқинг. Агар безовталик сигнали йўқолмаса, дилерингизга ёки Huawei техник қўллаб-қувватлаш бўлимига мурожаат қилинг.
uz_uz: O'zgaruvchan tokning chiqish o'chirgichi va o'zgarmas tokning kirish o'chirgichini o'chiring, va 5 daqiqadan so'ng ularni yoqing. Agar bezovtalik signali yo'qolmasa, dileringizga yoki Huawei texnik qo'llab-quvvatlash bo'limiga murojaat qiling.

# alarm_name_2031
source: Short Circuit Between Grid Phase Wire and PE
ru_ru: Короткое замыкание между проводом фазы сети и защитным заземлением
uz_cyrl: Тармоқ фазаси сими ва PE ўртасидаги қисқа туташув
uz_uz: Tarmoq fazasi simi va PE o'rtasidagi qisqa tutashuv

# alarm_cause_2031
source: The impedance of the output phase wire to PE is low or the output phase wire is short-circuited to PE.
ru_ru: Сопротивление провода выходной фазы относительно PE низкое или провод выходной фазы закорочен на PE.
uz_cyrl: Чиқиш фазаси симининг PE га қаршилиги паст ёки чиқиш фазаси симининг PE га қисқа туташуви.
uz_uz: Chiqish fazasi simining PE ga qarshiligi past yoki chiqish fazasi simining PE ga qisqa tutashuvi.

# alarm_suggestion_2031
source: Check the impedance of the output phase wire to PE, locate the position with low impedance, and rectify the fault.
ru_ru: Проверьте сопротивление провода выходной фазы к PE, найдите место с низким сопротивлением и устраните неисправность.
uz_cyrl: Чиқиш фазаси симининг PE га нисбатан қаршилигини текширинг, паст қаршиликка эга жойни топинг ва муаммони бартараф этинг.
uz_uz: Chiqish fazasi simining PEga nisbatan qarshiligini tekshiring, past qarshilikka ega joyni toping va muammoni bartaraf eting.

# alarm_name_2032
source: Grid Failure
ru_ru: Отказ сети
uz_cyrl: Тармоқ хатоси
uz_uz: Tarmoq xatosi

# alarm_cause_2032
source: 1. The power grid experiences an outage. 2. The AC circuit is disconnected or the AC circuit breaker is OFF.
ru_ru: 1. В электросети произошел сбой. 2. Цепь переменного тока отключена или автоматический выключатель переменного тока ВЫКЛЮЧЕН.
uz_cyrl: 1. Электр тармоғида узилиш. 2. Ўзгарувчан ток занжири узилган ёки ўзгарувчан ток ўчиргичи ЎЧИК ҳолатда қолган.
uz_uz: 1. Elektr tarmog'ida uzilish. 2. O'zgaruvchan tok zanjiri uzilgan yoki o'zgaruvchan tok o'chirgichi O'CHIK holatda qolgan

# alarm_suggestion_2032
source: 1. Check the AC voltage. 2. Check whether the AC circuit is disconnected or the AC circuit breaker is OFF.
ru_ru: 1. Проверьте напряжение переменного тока. 2. Проверьте, отключена ли цепь переменного тока или выключатель переменного тока выключен.
uz_cyrl: 1. Ўзгарувчан ток кучланишини текширинг. 2. Ўзгарувчан ток занжири узилган ёки автоматик ўчиргичи ўчирилганлигини текширинг.
uz_uz: 1. O'zgaruvchan tok kuchlanishini tekshiring. 2. O'zgaruvchan tok zanjiri uzilgan yoki avtomatik o'chirgichi o'chirilganligini tekshiring.

# alarm_name_2033
source: Grid Undervoltage
ru_ru: Пониженное напряжение в сети
uz_cyrl: Тармоқнинг паст кучланиши
uz_uz: Tarmoqning past kuchlanishi

# alarm_cause_2033
source: The grid voltage is below the lower threshold or the low voltage duration has lasted for more than the value specified by low voltage ride-through (LVRT).
ru_ru: Напряжение сети ниже нижнего порога, или продолжительность низкого напряжения превышает значение, указанное в функции поддержки низкого напряжения (LVRT).
uz_cyrl: Ушбу сигнал чизиқ кучланиши паст чегарадан пастга тушганда ёки паст кучланишнинг давомийлиги паст кучланишни қўллаб-қувватлаш (LVRT) функциясида кўрсатилган қийматдан ошиб кетганда ҳосил бўлади.
uz_uz: Ushbu signal chiziq kuchlanishi past chegaradan pastga tushganda yoki past kuchlanishning davomiyligi past kuchlanishni qo'llab-quvvatlash (LVRT) funktsiyasida ko'rsatilgan qiymatdan oshib ketganda hosil bo'ladi.

# alarm_suggestion_2033
source: 1. If the alarm occurs occasionally, the power grid may be abnormal temporarily. The SUN2000 automatically recovers after detecting that the power grid becomes normal. 2. If the alarm occurs frequently, check whether the power grid voltage is within the allowed range. If not, contact the local power operator. If yes, modify the grid undervoltage protection threshold through the mobile app, SmartLogger, or network management system (NMS) with the consent of the local power operator. 3. If the alarm persists for a long time, check the connection between the AC switch and the output power cable.
ru_ru: 1. Если сигнал тревоги возникает время от времени, возможно, электросеть временно неисправна. SUN2000 автоматически восстанавливает работу после обнаружения, что электросеть приходит в норму. 2. Если сигнал тревоги возникает часто, проверьте, находится ли напряжение электросети в допустимом диапазоне. В противном случае обратитесь к местному оператору электроснабжения. Если да, измените порог защиты от пониженного напряжения в сети через мобильное приложение, SmartLogger или систему управления сетью (NMS) с согласия местного оператора электроэнергетики. 3. Если сигнал тревоги сохраняется в течение длительного времени, проверьте соединение между выключателем переменного тока и выходным силовым кабелем.
uz_cyrl: 1. Агар сигнал вақти-вақти билан пайдо бўлса, электр тармоғи вақтинча носоз бўлиши мумкин. SUN2000 электр тармоғининг нормал ҳолатини аниқлаганидан сўнг автоматик равишда тикланади. 2. Агар сигнал тез-тез рўй берса, сиз электр тармоғининг кучланиши мақбул диапазонда эканлигини текширишингиз керак. Акс ҳолда, маҳаллий электр таъминоти операторига мурожаат қилиш тавсия этилади. Агар тармоқдаги кучланиш мақбул диапазонда бўлса, паст кучланишдан ҳимоя қилиш чегараси маҳаллий энергия операторининг розилиги билан мобил илова, SmartLogger ёки Тармоқни бошқариш тизими (NMS) орқали ўзгартирилиши мумкин. 3. Агар сигнал узоқ вақт давом этса, сиз ўзгарувчан ток ўчиргичи ва чиқиш қувват кабели ўртасидаги алоқани текширишингиз керак.
uz_uz: 1. Agar signal vaqti-vaqti bilan paydo bo'lsa, elektr tarmog'i vaqtincha nosoz bo'lishi mumkin. SUN2000 elektr tarmog'ining normal holatini aniqlaganidan so'ng avtomatik ravishda tiklanadi. 2. Agar signal tez-tez ro'y bersa, siz elektr tarmog'ining kuchlanishi maqbul diapazonda ekanligini tekshirishingiz kerak. Aks holda, mahalliy elektr ta'minoti operatoriga murojaat qilish tavsiya etiladi. Agar tarmoqdagi kuchlanish maqbul diapazonda bo'lsa, past kuchlanishdan himoya qilish chegarasi mahalliy energiya operatorining roziligi bilan mobil ilova, SmartLogger yoki Tarmoqni boshqarish tizimi (NMS) orqali o'zgartirilishi mumkin. 3. Agar signal uzoq vaqt davom etsa, siz o’'zgaruvchan tok o'chirgichi va chiqish quvvat kabeli o'rtasidagi aloqani tekshirishingiz kerak.

# alarm_name_2034
source: Grid Overvoltage
ru_ru: Перенапряжение в сети
uz_cyrl: Тармоқда ҳаддан ташқари кучланиш
uz_uz: Tarmoqda haddan tashqari kuchlanish

# alarm_cause_2034
source: The grid voltage exceeds the higher threshold or the high voltage has lasted for more than the value specified by high voltage ride-through (HVRT).
ru_ru: Напряжение сети превышает верхний порог, или высокое напряжение длилось дольше, чем значение, указанное в функции защиты от высокого напряжения (HVRT).
uz_cyrl: Ушбу сигнал тармоқ кучланиши юқори чегарадан ошиб кетганда ёки юқори кучланиш юқори кучланиш компенсацияси (HVRT) тизимида белгиланган қийматдан узоқроқ давом этганда ҳосил бўлади.
uz_uz: Ushbu signal tarmoq kuchlanishi yuqori chegaradan oshib ketganda yoki yuqori kuchlanish yuqori kuchlanish kompensatsiyasi (HVRT) tizimida belgilangan qiymatdan uzoqroq davom etganda hosil bo'ladi.

# alarm_suggestion_2034
source: 1. If the alarm occurs occasionally, the power grid may be abnormal temporarily. The SUN2000 automatically recovers after detecting that the power grid becomes normal. 2. If the alarm occurs frequently, check whether the power grid voltage is within the allowed range. If not, contact the local power operator. If yes, modify the grid overvoltage protection threshold through the mobile app, SmartLogger, or NMS with the consent of the local power operator. 3. Check whether the peak voltage of the power grid is too high. If the alarm persists and cannot be rectified for a long time, contact the power operator.
ru_ru: 1. Если сигнал тревоги возникает время от времени, возможно, электросеть временно неисправна. SUN2000 автоматически восстанавливает работу после обнаружения того, что электросеть приходит в норму. 2. Если сигнал тревоги возникает часто, проверьте, находится ли напряжение электросети в допустимом диапазоне. В противном случае обратитесь к местному оператору электроснабжения. Если да, измените порог защиты от перенапряжения в сети через мобильное приложение, SmartLogger или NMS с согласия местного оператора электроэнергетики. 3. Проверьте, не слишком ли велико пиковое напряжение электросети. Если сигнал тревоги сохраняется и не может быть устранен в течение длительного времени, обратитесь к энергетической компании.
uz_cyrl: 1. Агар сигнал вақти-вақти билан пайдо бўлса, электр тармоғи вақтинча носоз бўлиши мумкин. SUN2000 электр тармоғининг нормал ҳолатини аниқлаганидан сўнг автоматик равишда тикланади. 2. Агар сигнал тез-тез рўй берса, сиз электр тармоғининг кучланиши мақбул диапазонда эканлигини текширишингиз керак. Акс ҳолда, маҳаллий электр таъминоти операторига мурожаат қилиш тавсия этилади. Агар тармоқдаги кучланиш мақбул диапазонда бўлса, паст кучланишдан ҳимоя қилиш чегараси маҳаллий энергия операторининг розилиги билан мобил илова, SmartLogger ёки Тармоқни бошқариш тизими (NMS) орқали ўзгартирилиши мумкин. 3. Шунингдек, электр тармоғидаги энг юқори кучланишнинг рухсат этилган қийматлардан ошиб кетмаганлигини текшириш керак. Агар сигнал сақланиб турса ва узоқ вақт давомида бартараф этилмаса, электр таъминоти операторига мурожаат қилиш тавсия этилади.
uz_uz: 1. Agar signal vaqti-vaqti bilan paydo bo'lsa, elektr tarmog'i vaqtincha nosoz bo'lishi mumkin. SUN2000 elektr tarmog'ining normal holatini aniqlaganidan so'ng avtomatik ravishda tiklanadi. 2. Agar signal tez-tez ro'y bersa, siz elektr tarmog'ining kuchlanishi maqbul diapazonda ekanligini tekshirishingiz kerak. Aks holda, mahalliy elektr ta'minoti operatoriga murojaat qilish tavsiya etiladi. Agar tarmoqdagi kuchlanish maqbul diapazonda bo'lsa, past kuchlanishdan himoya qilish chegarasi mahalliy energiya operatorining roziligi bilan mobil ilova, SmartLogger yoki Tarmoqni boshqarish tizimi (NMS) orqali o'zgartirilishi mumkin. 3. Shuningdek, elektr tarmog'idagi eng yuqori kuchlanishning ruxsat etilgan qiymatlardan oshib ketmaganligini tekshirish kerak. Agar signal saqlanib tursa va uzoq vaqt davomida bartaraf etilmasa, elektr ta'minoti operatoriga murojaat qilish tavsiya etiladi.

# alarm_name_2035
source: Grid Voltage Imbalance
ru_ru: Дисбаланс напряжений в сети
uz_cyrl: Тармоқ кучланишининг номутаносиблиги
uz_uz: Tarmoq kuchlanishining nomutanosibligi

# alarm_cause_2035
source: The difference between grid phase voltages exceeds the upper threshold.
ru_ru: Разница между фазными напряжениями сети превышает верхний порог.
uz_cyrl: Тармоқнинг фазали кучланишлари орасидаги фарқ юқори чегарадан ошиб кетади.
uz_uz: Tarmoqning fazali kuchlanishlari orasidagi farq yuqori chegaradan oshib ketadi.

# alarm_suggestion_2035
source: 1. If the alarm occurs occasionally, the power grid may be abnormal temporarily. The SUN2000 automatically recovers after detecting that the power grid becomes normal. 2. If the alarm persists, check whether the power grid voltage is within the acceptable range. If not, contact the local power operator. 3. If the alarm lasts for a long time, check the AC output power cable connection. 4. If the AC output power cable is correctly connected, yet the alarm persists and affects the energy yield of the PV plant, contact the local power operator.
ru_ru: 1. Если сигнал тревоги возникает время от времени, возможно, электросеть временно неисправна. SUN2000 автоматически восстанавливает работу после обнаружения, что электросеть становится нормальной. 2. Если сигнал тревоги не исчезнет, проверьте, находится ли напряжение электросети в допустимых пределах. В противном случае обратитесь к местному оператору электроснабжения. 3. Если сигнал тревоги сохраняется в течение длительного времени, проверьте подключение кабеля выходной мощности переменного тока. 4. Если выходной силовой кабель переменного тока подключен правильно, но сигнал тревоги сохраняется и влияет на выработку энергии фотоэлектрической электростанции, обратитесь к местному оператору электроэнергетики.
uz_cyrl: 1. Агар сигнал вақти-вақти билан пайдо бўлса, электр тармоғи вақтинча носоз бўлиши мумкин. SUN2000 электр тармоғининг нормал ҳолатини аниқлаганидан сўнг автоматик равишда тикланади. 2. Агар сигнал ўчмаса, тармоқ кучланишининг мақбул чегаралар ичида эканлигини текшириш керак. Акс ҳолда, маҳаллий электр таъминоти операторига мурожаат қилиш тавсия этилади. 3. Агар сигнал узоқ вақт давом этса, ўзгарувчан токнинг чиқиш кабелининг уланишини текшириш керак. 4. Агар ўзгарувчан токнинг чиқиш қувват кабели тўғри уланган бўлса, лекин сигнал сақланиб турса ва фотоэлектрик электр станциясининг қувватига таъсир этса, маҳаллий энергия операторига мурожаат қилиш тавсия этилади.
uz_uz: 1. Agar signal vaqti-vaqti bilan paydo bo'lsa, elektr tarmog'i vaqtincha nosoz bo'lishi mumkin. SUN2000 elektr tarmog'ining normal holatini aniqlaganidan so'ng avtomatik ravishda tiklanadi. 2. Agar signal o'chmasa, tarmoq kuchlanishining maqbul chegaralar ichida ekanligini tekshirish kerak. Aks holda, mahalliy elektr ta'minoti operatoriga murojaat qilish tavsiya etiladi. 3. Agar signal uzoq vaqt davom etsa, o'zgaruvchan tokning chiqish kabelining ulanishini tekshirish kerak. 4. Agar o'zgaruvchan tokning chiqish quvvat kabeli to'g'ri ulangan bo'lsa, lekin signal saqlanib tursa va fotoelektrik elektr stantsiyasining quvvatiga ta'sir etsa, mahalliy energiya operatoriga murojaat qilish tavsiya etiladi.
